-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Mar 20, 2025 at 12:06 PM
-- Server version: 10.1.47-MariaDB
-- PHP Version: 8.0.14

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `sql_cwie_lru_ac_`
--

-- --------------------------------------------------------

--
-- Table structure for table `activity`
--

CREATE TABLE `activity` (
  `id` int(10) NOT NULL,
  `activity_type` varchar(100) NOT NULL,
  `activity_id` varchar(10) NOT NULL,
  `activity_name` varchar(250) NOT NULL,
  `activity_date` varchar(100) NOT NULL,
  `details` text NOT NULL,
  `filename` varchar(200) NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `activity_cwie`
--

CREATE TABLE `activity_cwie` (
  `id` int(10) NOT NULL,
  `faculty_id` varchar(10) NOT NULL,
  `activity_id` varchar(20) NOT NULL,
  `activity_type` varchar(100) NOT NULL,
  `activity_name` varchar(250) NOT NULL,
  `course` text NOT NULL,
  `activity_date` varchar(100) NOT NULL,
  `amount` varchar(10) NOT NULL,
  `note` varchar(250) NOT NULL,
  `filename` varchar(200) NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `year` varchar(50) DEFAULT '2/2566'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `activity_cwie`
--

INSERT INTO `activity_cwie` (`id`, `faculty_id`, `activity_id`, `activity_type`, `activity_name`, `course`, `activity_date`, `amount`, `note`, `filename`, `date_regis`, `year`) VALUES
(1, '03', '1', 'กิจกรรมนักศึกษา', 'การพัฒนาคุณภาพบัณฑิตด้วยสหกิจศึกษาคณะเทคโนโลยีอุตสาหกรรม', 'ทุกหลักสูตร', '6,7,13กรกฎาคม 2567', '40', '', '19032025142253.jpg', '2025-03-19 06:22:53', '2/2567'),
(2, '03', '2', 'กิจกรรมอาจารย์', 'อบรมเชิงปฏิบัติการ การแลกเปลี่ยนเรียนรู้สหกิจศึกษา', 'ทุกหลักสูตร', '1 มีนาคม 2567', '15', '', '19032025142840.jpg', '2025-03-19 06:28:40', '2/2567'),
(6, '01', '1', 'กิจกรรมนักศึกษา', 'โครงการ \"ปัจฉิมนิเทศนักศึกษาและแนะแนวสู่การทำงานอย่างมั่นคง\" คณะวิทยาการจัดการ มหาวิทยาลัยราชภัฏเลย', 'สาขาวิชาการจัดการ, สาขาวิชาการตลาดดิจิทัล, สาขาวิชาคอมพิวเตอร์ธุรกิจดิจิทัล, สาขาวิชาการจัดการโลจิสติกส์และซัพพลายเชน, สาขาวิชาการบัญชี, สาขาวิชาการท่องเที่ยวและการโรงแรม, สาขาวิชานิเทศศาสตร์ดิจิทัล, สาขาวิชาการจัดการ, สาขาวิชาการบัญชี', '10 มีนาคม 2568', '276', '', '19032025172254.jpg', '2025-03-19 09:22:54', '2/2567'),
(7, '01', '1', 'กิจกรรมนักศึกษา', 'โครงการพัฒนาศักยภาพนักศึกษาสหกิจศึกษาและพัฒนาหลักสูตรด้วยการศึกษาเชิงบูรณาการกับการทำงาน (Cooperative and Work-Integrated Education : CWIE)', 'สาขาวิชาการจัดการ, สาขาวิชาการตลาดดิจิทัล, สาขาวิชาคอมพิวเตอร์ธุรกิจดิจิทัล, สาขาวิชาการจัดการโลจิสติกส์และซัพพลายเชน, สาขาวิชาการบัญชี, สาขาวิชาการท่องเที่ยวและการโรงแรม, สาขาวิชานิเทศศาสตร์ดิจิทัล, สาขาวิชาการจัดการ, สาขาวิชาการบัญชี', '18 กันยายน 2567', '193', '', '19032025172709.jpg', '2025-03-19 09:27:09', '2/2567');

-- --------------------------------------------------------

--
-- Table structure for table `activity_photo`
--

CREATE TABLE `activity_photo` (
  `id` int(10) NOT NULL,
  `activity_id` varchar(50) NOT NULL,
  `filename` varchar(200) NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `activity_type`
--

CREATE TABLE `activity_type` (
  `id` int(10) NOT NULL,
  `activity_type` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `activity_type`
--

INSERT INTO `activity_type` (`id`, `activity_type`) VALUES
(1, 'กิจกรรมนักศึกษา'),
(2, 'กิจกรรมอาจารย์'),
(3, 'กิจกรรมร่วมกับสถานประกอบการ');

-- --------------------------------------------------------

--
-- Table structure for table `approval_tokens`
--

CREATE TABLE `approval_tokens` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `course`
--

CREATE TABLE `course` (
  `id` int(10) NOT NULL,
  `id_course` varchar(10) NOT NULL,
  `name_course` varchar(250) NOT NULL,
  `id_faculty` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `course`
--

INSERT INTO `course` (`id`, `id_course`, `name_course`, `id_faculty`) VALUES
(1, '01', 'วิทยาการคอมพิวเตอร์', '02'),
(2, '02', 'อาหารและโภชนาการ', '02'),
(3, '03', 'สัตวศาสตร์', '02'),
(4, '04', 'วิทยาศาสตร์สิ่งแวดล้อม', '02'),
(5, '05', 'เคมี', '02'),
(6, '06', 'ฟิสิกส์', '02'),
(7, '07', 'เกษตรศาสตร์', '02'),
(8, '08', 'คณิตศาสตร์', '02'),
(9, '09', 'ชีววิทยา', '02'),
(10, '10', 'สาธารณสุขศาสตร์', '02'),
(11, '11', 'เทคโนโลยีสารสนเทศ', '02'),
(12, '12', 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', '02'),
(13, '13', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', '02'),
(14, '01', 'เทคโนโลยีโยธา', '03'),
(15, '02', 'เทคโนโลยีวิศวกรรมการผลิต', '03'),
(16, '03', 'เทคโนโลยีอิเล็กทรอนิกส์และคอมพิวเตอร์', '03'),
(17, '04', 'วิศวกรรมการผลิต ', '03'),
(18, '05', 'เทคโนโลยีวิศวกรรมเซรามิกส์', '03'),
(19, '06', 'วิศวกรรมการจัดการ', '03'),
(20, '07', 'วิศวกรรมไฟฟ้าและอิเล็กทรอนิกส์', '03'),
(21, '08', 'วิศวกรรมการออกแบบและผลิต', '03'),
(22, '09', 'วิศวกรรมโยธาและบริหารงานก่อสร้าง', '03');

-- --------------------------------------------------------

--
-- Table structure for table `cwie_course`
--

CREATE TABLE `cwie_course` (
  `id` int(10) NOT NULL,
  `faculty_id` varchar(10) NOT NULL,
  `major` varchar(200) NOT NULL,
  `separate` varchar(10) NOT NULL,
  `parallel` varchar(10) NOT NULL,
  `mix` varchar(10) NOT NULL,
  `sil` varchar(10) DEFAULT NULL,
  `note` varchar(250) NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `year` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `cwie_course`
--

INSERT INTO `cwie_course` (`id`, `faculty_id`, `major`, `separate`, `parallel`, `mix`, `sil`, `note`, `date_regis`, `year`) VALUES
(7, '02', 'คณิตศาสตร์', '/', '', '', NULL, '', '2025-03-14 07:07:01', '2/2567'),
(8, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาเคมีประยุกต์', '/', '', '', NULL, '', '2025-03-14 07:07:51', '2/2567'),
(9, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาวิทยาศาสตร์ชีวภาพ', '/', '', '', NULL, '', '2025-03-14 07:08:11', '2/2567'),
(10, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาวิทยาการคอมพิวเตอร์', '/', '', '', NULL, '', '2025-03-14 07:08:32', '2/2567'),
(11, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาเทคโนโลยีสารสนเทศ', '/', '', '', NULL, '', '2025-03-14 07:08:49', '2/2567'),
(12, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมการออกแบบและผลิต', '/', '', '', NULL, '', '2025-03-19 01:00:10', '2/2567'),
(13, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรม', '/', '', '', NULL, '', '2025-03-19 01:00:37', '2/2567'),
(14, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมโยธาและบริหารงานก่อสร้าง', '/', '', '', NULL, '', '2025-03-19 01:00:50', '2/2567'),
(15, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมไฟฟ้าและอิเล็กทรอนิกส์', '/', '', '', NULL, '', '2025-03-19 01:00:58', '2/2567'),
(16, '01', 'หลักสูตรบัญชีบัณฑิต (บช.บ.) 4 ปี--สาขาวิชาการบัญชี', '/', '', '', NULL, '', '2025-03-19 07:35:38', '2/2567'),
(17, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการ', '/', '', '', NULL, '', '2025-03-19 07:35:56', '2/2567'),
(18, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาคอมพิวเตอร์ธุรกิจดิจิทัล', '/', '', '', NULL, '', '2025-03-19 07:36:16', '2/2567'),
(19, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการตลาดดิจิทัล', '/', '', '', NULL, '', '2025-03-19 07:36:25', '2/2567'),
(20, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการโลจิสติกส์และซัพพลายเชน', '/', '', '', NULL, '', '2025-03-19 07:36:35', '2/2567'),
(21, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการธุรกิจการค้าสมัยใหม่', '', '/', '', NULL, '', '2025-03-19 07:36:52', '2/2567'),
(22, '01', 'หลักสูตรเศรษฐศาสตรบัณฑิต (ศ.บ.) 4 ปี--สาขาวิชาเศรษฐศาสตร์', '/', '', '', NULL, '', '2025-03-19 07:37:08', '2/2567'),
(23, '01', 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) 4 ปี--สาขาวิชาการท่องเที่ยวและการโรงแรม', '', '', '/', NULL, '', '2025-03-19 07:37:20', '2/2567'),
(24, '01', 'หลักสูตรนิเทศศาสตรบัณฑิต (นศ.บ.) 4 ปี--สาขาวิชานิเทศศาสตร์ดิจิทัล', '', '/', '', NULL, '', '2025-03-19 07:37:38', '2/2567');

-- --------------------------------------------------------

--
-- Table structure for table `day`
--

CREATE TABLE `day` (
  `id` int(10) NOT NULL,
  `day` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `day`
--

INSERT INTO `day` (`id`, `day`) VALUES
(1, '1'),
(2, '2'),
(3, '3'),
(4, '4'),
(5, '5'),
(6, '6'),
(7, '7'),
(8, '8'),
(9, '9'),
(10, '10'),
(11, '11'),
(12, '12'),
(13, '13'),
(14, '14'),
(15, '15'),
(16, '16'),
(17, '17'),
(18, '18'),
(19, '19'),
(20, '20'),
(21, '21'),
(22, '22'),
(23, '23'),
(24, '24'),
(25, '25'),
(26, '26'),
(27, '27'),
(28, '28'),
(29, '29'),
(30, '30'),
(31, '31');

-- --------------------------------------------------------

--
-- Table structure for table `faculty`
--

CREATE TABLE `faculty` (
  `id` int(10) NOT NULL,
  `fid` varchar(10) NOT NULL,
  `faculty` varchar(250) NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `faculty`
--

INSERT INTO `faculty` (`id`, `fid`, `faculty`, `date_regis`) VALUES
(1, '01', 'คณะวิทยาการจัดการ', '2023-05-21 02:04:13'),
(2, '02', 'คณะวิทยาศาสตร์และเทคโนโลยี', '2023-05-21 02:04:16'),
(3, '03', 'คณะเทคโนโลยีอุตสาหกรรม', '2023-05-21 02:04:19'),
(4, '04', 'คณะมนุษยศาสตร์และสังคมศาสตร์', '2023-05-21 02:04:21'),
(5, '05', 'คณะครุศาสตร์', '2023-05-21 02:30:17');

-- --------------------------------------------------------

--
-- Table structure for table `job_cwie`
--

CREATE TABLE `job_cwie` (
  `id` int(10) NOT NULL,
  `job_title` varchar(100) NOT NULL,
  `company` varchar(100) NOT NULL,
  `job_des` text NOT NULL,
  `filename` varchar(100) NOT NULL,
  `link` text NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `job_cwie`
--

INSERT INTO `job_cwie` (`id`, `job_title`, `company`, `job_des`, `filename`, `link`, `date_regis`) VALUES
(7, 'IT (Programmer,Implementer)', 'บริษัท เจริญโภคภัณฑ์อาหาร จำกัด (มหาชน)', '1.ข้อมูลการทำงาน Programmer/Webmaster/IOS-Android/UX-UI อื่นๆ - งานด้านการรับผิดชอบติดตั้ง Software ขององค์กร และออกแบบกระบวนการพร้อมทั้งทดสอบระบบให้สามารถใช้งานได้ - งานด้าน Programmer :SAP(พัฒนาระบบ Software ต่างๆ) - งานด้านดูแลPPQA : Process and Product Quality Assurance Leader ดูแล Project ทางด้าน IT ตรวจสอบความถูกต้องให้กระบวนการITครบถูกต้องตามระบบ', '15092023140938.png', 'https://www.jobbkk.com/jobs/detail/36651/502496?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic', '2023-09-15 07:34:53'),
(8, 'IT. Support', 'บริษัท ไพรัชโฮมเดคคอร์ จำกัด', '- สามารถตรวจปัญหาระบบเน็ตเวิร์ค แก้ไขปัญหาและสามารถซ่อมบำรุงเครื่องคอมพิวเตอร์และอุปกรณ์ได้ - มีความรู้เกี่ยวกับการสำรองและกู้คืนระบบ - ดูแล Website มาก่อน - วิเคราะห์ข้อมูล และ งานอื่นๆ', '15092023141244.png', 'https://www.jobbkk.com/jobs/detail/36651/502496?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic', '2023-09-15 07:34:50'),
(9, 'IT Support', 'บริษัท สติวเดนท์ แคร์ จำกัด', '- IT Support ประจำ office - ดูแล ซ่อม แก้ไข เครื่องคอมพิวเตอร์ Network Server', '15092023143438.png', 'https://www.jobbkk.com/jobs/detail/36651/502496?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic', '2023-09-15 07:34:38'),
(11, 'Developer', 'Krungthai Bank', '- Master or Bachelor Degree in Computer Science, ComputerEngineering, Information Technology or Related Field\r\n- At Least 3-5 Year experienced in Software Development\r\n- Strong in Java\r\n- Experienced in Framework Spring Boot, Struts, JSF Etc.\r\n- Experienced in Database Oracle, DB2 Etc.\r\n- Experienced in Front-End or Back-End or Both\r\n- Knowledge of New Tech Stack', '25062024204141.png', 'https://g.co/kgs/3kBPDRF', '2024-06-25 13:41:41');

-- --------------------------------------------------------

--
-- Table structure for table `major`
--

CREATE TABLE `major` (
  `id` int(10) NOT NULL,
  `faculty` varchar(250) NOT NULL,
  `course` varchar(250) NOT NULL,
  `major` varchar(250) NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `major`
--

INSERT INTO `major` (`id`, `faculty`, `course`, `major`, `date_regis`) VALUES
(1, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี', 'สาขาวิชาการจัดการ', '0000-00-00 00:00:00'),
(2, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี', 'สาขาวิชาการตลาดดิจิทัล', '0000-00-00 00:00:00'),
(3, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี', 'สาขาวิชาคอมพิวเตอร์ธุรกิจดิจิทัล', '0000-00-00 00:00:00'),
(4, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี', 'สาขาวิชาการจัดการโลจิสติกส์และซัพพลายเชน', '0000-00-00 00:00:00'),
(5, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี', 'สาขาวิชาการจัดการธุรกิจการค้าสมัยใหม่', '0000-00-00 00:00:00'),
(6, '01', 'หลักสูตรบัญชีบัณฑิต (บช.บ.) 4 ปี', 'สาขาวิชาการบัญชี', '0000-00-00 00:00:00'),
(7, '01', 'หลักสูตรเศรษฐศาสตรบัณฑิต (ศ.บ.) 4 ปี', 'สาขาวิชาเศรษฐศาสตร์', '0000-00-00 00:00:00'),
(8, '01', 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) 4 ปี', 'สาขาวิชาการท่องเที่ยวและการโรงแรม', '0000-00-00 00:00:00'),
(9, '01', 'หลักสูตรนิเทศศาสตรบัณฑิต (นศ.บ.) 4 ปี', 'สาขาวิชานิเทศศาสตร์ดิจิทัล', '0000-00-00 00:00:00'),
(10, '01', 'หลักสูตรบริหารธุรกิจมหาบัณฑิต (บธ.ม.)', 'สาขาวิชาการจัดการ', '0000-00-00 00:00:00'),
(11, '01', 'หลักสูตรบริหารธุรกิจมหาบัณฑิต (บธ.ม.)', 'สาขาวิชาการบัญชี', '0000-00-00 00:00:00'),
(12, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี', 'สาขาวิชาเคมีประยุกต์', '0000-00-00 00:00:00'),
(13, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี', 'สาขาวิชาฟิสิกส์', '0000-00-00 00:00:00'),
(14, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี', 'สาขาวิชาวิทยาศาสตร์ชีวภาพ', '0000-00-00 00:00:00'),
(15, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี', 'สาขาวิชาวิทยาการคอมพิวเตอร์', '0000-00-00 00:00:00'),
(16, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี', 'สาขาวิชาเทคโนโลยีสารสนเทศ', '0000-00-00 00:00:00'),
(17, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี', 'สาขาวิชาเกษตรศาสตร์', '0000-00-00 00:00:00'),
(18, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี', 'สาขาวิชาอาหารและโภชนาการ', '0000-00-00 00:00:00'),
(19, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี', 'สาขาวิชาเทคโนโลยีอาหาร', '0000-00-00 00:00:00'),
(20, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี', 'สาชาวิชาสัตวศาสตร์', '0000-00-00 00:00:00'),
(21, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี', 'สาขาวิชาวิทยาศาสตร์และเทคโนโลยีสิ่งแวดล้อม', '0000-00-00 00:00:00'),
(22, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี', 'สาขาวิชาคณิตศาสตร์', '0000-00-00 00:00:00'),
(23, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี', 'สาขาวิชาวิทยาศาสตร์การกีฬาและการออกกำลังกาย', '0000-00-00 00:00:00'),
(24, '02', 'หลักสูตรสาธารณสุขศาสตรบัณฑิต (ส.บ.) 4 ปี', 'สาขาวิชาสาธารณสุขศาสตร์', '0000-00-00 00:00:00'),
(25, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี', 'สาขาวิชาวิศวกรรมโยธาและบริหารงานก่อสร้าง', '0000-00-00 00:00:00'),
(26, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี', 'สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรม', '0000-00-00 00:00:00'),
(27, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี', 'สาขาวิชาวิศวกรรมการออกแบบและผลิต', '0000-00-00 00:00:00'),
(28, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี', 'สาขาวิชาวิศวกรรมไฟฟ้าและอิเล็กทรอนิกส์', '0000-00-00 00:00:00'),
(29, '04', 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) 4 ปี', 'สาขาวิชาการพัฒนาชุมชน', '0000-00-00 00:00:00'),
(30, '04', 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) 4 ปี', 'สาขาวิชาภาษาไทย', '0000-00-00 00:00:00'),
(31, '04', 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) 4 ปี', 'สาขาวิชาภาษาอังกฤษ', '0000-00-00 00:00:00'),
(32, '04', 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) 4 ปี', 'สาขาวิชาภาษาอังกฤษธุรกิจ', '0000-00-00 00:00:00'),
(33, '04', 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) 4 ปี', 'สาขาวิชาภาษาจีนและภาษาอังกฤษเพื่อการสื่อสาร', '0000-00-00 00:00:00'),
(34, '04', 'หลักสูตรศิลปกรรมศาสตรบัณฑิต (ศป.บ.) 4 ปี', 'สาขาวิชาทัศนศิลป์', '0000-00-00 00:00:00'),
(35, '04', 'หลักสูตรศิลปกรรมศาสตรบัณฑิต (ศป.บ.) 4 ปี', 'สาขาวิชาดุริยางคศิลป์', '0000-00-00 00:00:00'),
(36, '04', 'หลักสูตรศิลปกรรมศาสตรบัณฑิต (ศป.บ.) 4 ปี', 'สาขาวิชาดิจิตอลอาร์ต', '0000-00-00 00:00:00'),
(37, '04', 'หลักสูตรนิติศาสตรบัณฑิต (น.บ.) 4 ปี', 'สาขาวิชานิติศาสตร์', '0000-00-00 00:00:00'),
(38, '04', 'หลักสูตรรัฐประศาสนศาสตรบัณฑิต (รป.บ.) 4 ปี', 'สาขาวิชารัฐประศาสนศาสตร์', '0000-00-00 00:00:00'),
(39, '04', 'หลักสูตรศิลปศาสตรมหาบัณฑิต (ศศ.ม.)', 'สาขาวิชาพัฒนาสังคม', '0000-00-00 00:00:00'),
(40, '04', 'หลักสูตรศิลปศาสตรมหาบัณฑิต (ศศ.ม.)', 'สาขาวิชาภาษาอังกฤษ', '0000-00-00 00:00:00'),
(41, '04', 'หลักสูตรศิลปศาสตรมหาบัณฑิต (ศศ.ม.)', 'สาขาวิชาภาษาไทย', '0000-00-00 00:00:00'),
(42, '04', 'หลักสูตรปรัชญาดุษฎีบัณฑิต (ปร.ด.)', 'สาขาวิชาพัฒนาสังคม', '0000-00-00 00:00:00'),
(43, '04', 'หลักสูตรปรัชญาดุษฎีบัณฑิต (ปร.ด.)', 'สาขาวิชายุทธศาสตร์การพัฒนาภูมิภาค', '0000-00-00 00:00:00'),
(44, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาการศึกษาปฐมวัย', '0000-00-00 00:00:00'),
(45, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาภาษาอังกฤษ', '0000-00-00 00:00:00'),
(46, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาภาษาไทย', '0000-00-00 00:00:00'),
(47, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาสังคมศึกษา', '0000-00-00 00:00:00'),
(48, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาศิลปศึกษา', '0000-00-00 00:00:00'),
(49, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชานาฏศิลป์', '0000-00-00 00:00:00'),
(50, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาดนตรีศึกษา', '0000-00-00 00:00:00'),
(51, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาคอมพิวเตอร์ศึกษา', '0000-00-00 00:00:00'),
(52, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาคณิตศาสตร์', '0000-00-00 00:00:00'),
(53, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาพลศึกษา', '0000-00-00 00:00:00'),
(54, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาเคมี', '0000-00-00 00:00:00'),
(55, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาชีววิทยา', '0000-00-00 00:00:00'),
(56, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาฟิสิกส์', '0000-00-00 00:00:00'),
(57, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาวิทยาศาสตร์ทั่วไป', '0000-00-00 00:00:00'),
(58, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาการประถมศึกษา', '0000-00-00 00:00:00'),
(59, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาอุตสาหกรรมศิลป์', '0000-00-00 00:00:00'),
(60, '05', 'หลักสูตรครุศาสตรบัณฑิต (ค.บ.) 4 ปี', 'สาขาวิชาภาษาอังกฤษและบรรณารักษศาสตร์', '0000-00-00 00:00:00'),
(61, '05', 'หลักสูตรประกาศนียบัตรบัณฑิต', 'สาขาวิชาชีพครู', '0000-00-00 00:00:00'),
(62, '05', 'หลักสูตรครุศาสตรมหาบัณฑิต (ค.ม.)', 'สาขาวิชาการบริหารการศึกษา', '0000-00-00 00:00:00'),
(63, '05', 'หลักสูตรครุศาสตรมหาบัณฑิต (ค.ม.)', 'สาขาวิจัยนวัตกรรมทางการศึกษา', '0000-00-00 00:00:00'),
(64, '05', 'หลักสูตรปรัชญาดุษฎีบัณฑิต (ปร.ด.)', 'สาขาวิชาการบริหารการศึกษา', '2023-09-19 17:20:59');

-- --------------------------------------------------------

--
-- Table structure for table `mount`
--

CREATE TABLE `mount` (
  `id` int(10) NOT NULL,
  `mount` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `mount`
--

INSERT INTO `mount` (`id`, `mount`) VALUES
(1, 'มกราคม'),
(2, 'กุมภาพันธ์'),
(3, 'มีนาคม'),
(4, 'เมษายน'),
(5, 'พฤษภาคม'),
(6, 'มิถุนายน'),
(7, 'กรกฎาคม'),
(8, 'สิงหาคม'),
(9, 'กันยายน'),
(10, 'ตุลาคม'),
(11, 'พฤศจิกายน'),
(12, 'ธันวาคม');

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `id` int(11) NOT NULL,
  `title` varchar(250) NOT NULL,
  `date1` varchar(100) NOT NULL,
  `mou_year` varchar(100) NOT NULL,
  `detail` text NOT NULL,
  `detail2` text NOT NULL,
  `img` varchar(250) NOT NULL,
  `date_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `post_by` varchar(100) NOT NULL,
  `faculty_id` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `num_stu_cwie`
--

CREATE TABLE `num_stu_cwie` (
  `id` int(10) NOT NULL,
  `faculty_id` varchar(10) NOT NULL,
  `major` varchar(250) NOT NULL,
  `num_practice` varchar(20) NOT NULL,
  `num_cwie` varchar(20) NOT NULL,
  `num_pundit` varchar(20) NOT NULL,
  `num_pundit_job` varchar(20) NOT NULL,
  `num_pundit_job_work` varchar(20) NOT NULL,
  `note` varchar(250) NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `year` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `num_stu_cwie`
--

INSERT INTO `num_stu_cwie` (`id`, `faculty_id`, `major`, `num_practice`, `num_cwie`, `num_pundit`, `num_pundit_job`, `num_pundit_job_work`, `note`, `date_regis`, `year`) VALUES
(1, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาคณิตศาสตร์', '11', '4', '3', '3', '0', '', '2025-03-14 08:09:22', '2/2567'),
(2, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาเคมีประยุกต์', '3', '7', '0', '0', '0', '', '2025-03-14 08:18:34', '2/2567'),
(3, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาฟิสิกส์', '8', '0', '0', '0', '0', '', '2025-03-14 08:19:28', '2/2567'),
(4, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาวิทยาศาสตร์ชีวภาพ', '7', '2', '4', '3', '0', '', '2025-03-14 08:20:37', '2/2567'),
(5, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาวิทยาการคอมพิวเตอร์', '12', '6', '12', '6', '2', '', '2025-03-14 08:21:15', '2/2567'),
(6, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาเทคโนโลยีสารสนเทศ', '10', '1', '1', '1', '0', '', '2025-03-14 08:21:49', '2/2567'),
(7, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาเกษตรศาสตร์', '15', '0', '6', '1', '0', '', '2025-03-14 08:22:47', '2/2567'),
(8, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาอาหารและโภชนาการ', '18', '0', '0', '0', '0', '', '2025-03-14 08:23:28', '2/2567'),
(9, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาเทคโนโลยีอาหาร', '1', '0', '0', '0', '0', '', '2025-03-14 08:25:12', '2/2567'),
(10, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาวิทยาศาสตร์และเทคโนโลยีสิ่งแวดล้อม', '3', '0', '0', '0', '0', '', '2025-03-14 08:25:32', '2/2567'),
(11, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาชาวิชาสัตวศาสตร์', '9', '0', '0', '0', '0', '', '2025-03-14 08:25:52', '2/2567'),
(12, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาวิทยาศาสตร์การกีฬาและการออกกำลังกาย', '55', '0', '0', '0', '0', '', '2025-03-14 08:26:15', '2/2567'),
(13, '02', 'หลักสูตรสาธารณสุขศาสตรบัณฑิต (ส.บ.) 4 ปี--สาขาวิชาสาธารณสุขศาสตร์', '96', '0', '0', '0', '0', '', '2025-03-14 08:26:34', '2/2567'),
(14, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรม', '', '13', '11', '11', '7', '', '2025-03-19 01:07:49', '2/2567'),
(15, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมการออกแบบและผลิต', '0', '0', '10', '10', '7', '', '2025-03-19 01:08:54', '2/2567'),
(16, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมโยธาและบริหารงานก่อสร้าง', '0', '0', '7', '7', '7', '', '2025-03-19 01:09:15', '2/2567'),
(17, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมไฟฟ้าและอิเล็กทรอนิกส์', '0', '16', '25', '25', '21', '', '2025-03-19 01:11:52', '2/2567'),
(19, '01', 'หลักสูตรบัญชีบัณฑิต (บช.บ.) 4 ปี--สาขาวิชาการบัญชี', '18', '22', '22', '', '', '', '2025-03-20 01:24:02', '2/2567'),
(20, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการ', '26', '19', '19', '', '', '', '2025-03-20 01:23:53', '2/2567'),
(21, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการโลจิสติกส์และซัพพลายเชน', '3', '28', '28', '', '', '', '2025-03-20 01:23:43', '2/2567'),
(22, '01', 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) 4 ปี--สาขาวิชาการท่องเที่ยวและการโรงแรม', '8', '23', '23', '', '', '', '2025-03-20 01:23:34', '2/2567'),
(23, '01', 'หลักสูตรนิเทศศาสตรบัณฑิต (นศ.บ.) 4 ปี--สาขาวิชานิเทศศาสตร์ดิจิทัล', '', '8', '8', '', '', '', '2025-03-20 01:23:26', '2/2567'),
(24, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการตลาดดิจิทัล', '4', '3', '3', '', '', '', '2025-03-20 01:23:15', '2/2567'),
(25, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาคอมพิวเตอร์ธุรกิจดิจิทัล', '13', '18', '18', '', '', '', '2025-03-20 01:23:05', '2/2567');

-- --------------------------------------------------------

--
-- Table structure for table `num_tea_cwie`
--

CREATE TABLE `num_tea_cwie` (
  `id` int(11) NOT NULL,
  `faculty_id` varchar(10) NOT NULL,
  `course` varchar(250) NOT NULL,
  `name_tea_cwie` varchar(200) NOT NULL,
  `num_tea_cwie` varchar(20) NOT NULL,
  `note` varchar(250) NOT NULL,
  `filename` varchar(100) NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `year` varchar(50) DEFAULT '2/2566'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `num_tea_cwie`
--

INSERT INTO `num_tea_cwie` (`id`, `faculty_id`, `course`, `name_tea_cwie`, `num_tea_cwie`, `note`, `filename`, `date_regis`, `year`) VALUES
(1, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมโยธาและบริหารงานก่อสร้าง', 'นายโกเมนทร์  พร้อมจะบก', 'สสศท.006490', '', '', '2025-03-19 06:04:17', '2/2567'),
(2, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมการออกแบบและผลิต', 'ผศ.ภควดี  ศิริวัชรสุข', 'สสศท.004144', '', '', '2025-03-19 06:04:56', '2/2567'),
(3, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมการออกแบบและผลิต', 'ผศ.ดร.ศุภกัญญา ขันชัยภูมิ', '-', 'หลักสูตรคณาจารย์นิเทศ                   สหกิจศึกษามหาวิทยาลัยขอนแก่น  รุ่นที่ 1 โดย เครือข่ายสหกิจศึกษา             ภาคตะวันออกเฉียงเหนือตอนบนมหาวิทยาลัยขอนแก่น', '', '2025-03-19 06:05:47', '2/2567'),
(4, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมการออกแบบและผลิต', 'ดร.วันชาติ  สุพรมพิทักษ์', 'สสศท.006486', '', '', '2025-03-19 06:06:18', '2/2567'),
(5, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมไฟฟ้าและอิเล็กทรอนิกส์', 'ผศ.วุฒิภัทร จำรัสแนว', 'สสศท.005718', '', '', '2025-03-19 06:06:50', '2/2567'),
(6, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรม', 'ผศ.กานต์    จันทระ', 'สสศท.005717', '', '', '2025-03-19 06:07:13', '2/2567'),
(7, '03', 'หลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) 4 ปี--สาขาวิชาวิศวกรรมไฟฟ้าและอิเล็กทรอนิกส์', 'รศ.ดร.กิตติศักดิ์  แสนประสิทธิ์', '-', 'หลักสูตรคณาจารย์นิเทศและผู้นิเทศ CWIE และผู้ปฏิบัติงาน CWIE ในสถาบันอุดมศึกษาและสถานประกอบการ (ผ่านระบบออนไลน์) เครือข่ายสหกิจและการศึกษาเชิงบูรณาการกับการทำงาน ภาคตะวันออกเฉียงเหนือ', '', '2025-03-19 06:10:29', '2/2567'),
(8, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการ', 'ดร.ศศิธร  กกฝ้าย', '005727', '', '20032025091110.png', '2025-03-20 02:11:10', '2/2567'),
(9, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการ', 'ดร.เมทยา  อิ่มเอิบ', '005836', '', '20032025091055.png', '2025-03-20 02:10:55', '2/2567'),
(10, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการ', 'ผู้ช่วยศาสตราจารย์อภิรดี  คำไล้', '004112', '', '20032025091041.jpg', '2025-03-20 02:10:41', '2/2567'),
(11, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการ', 'อาจารย์วีระยุทธ  รัชตเวชกุล', '006488', '', '20032025091029.jpg', '2025-03-20 02:10:29', '2/2567'),
(12, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการ', 'ผู้ช่วยศาสตราจารย์ ดร.กานต์ธีรา  นามวงศ์', '006657', '', '20032025091015.png', '2025-03-20 02:10:15', '2/2567'),
(13, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการ', 'ผู้ช่วยศาสตราจารย์พรรณธวรรณ  บุตรดีสุวรรณ', '006477', '', '20032025090947.png', '2025-03-20 02:09:47', '2/2567'),
(14, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการ', 'อาจารย์วิลัยพร  ยาขามป้อม', '006482', '', '20032025090846.png', '2025-03-20 02:08:46', '2/2567'),
(15, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการ', 'อาจารย์เยาว์ธิดา  รัตนพลแสน', '005840', '', '20032025090831.png', '2025-03-20 02:08:31', '2/2567'),
(16, '01', 'หลักสูตรบัญชีบัณฑิต (บช.บ.) 4 ปี--สาขาวิชาการบัญชี', 'อาจารย์อุไรวรรณ  บุษทิพย์', '012228/MHESI-ONE2565', '', '20032025085448.png', '2025-03-20 01:54:48', '2/2567'),
(17, '01', 'หลักสูตรบัญชีบัณฑิต (บช.บ.) 4 ปี--สาขาวิชาการบัญชี', 'ผู้ช่วยศาสตราจารย์ ดร.ลภัสรดา  พิชญาธีรนาถ', '004117', '', '20032025090813.png', '2025-03-20 02:08:13', '2/2567'),
(18, '01', 'หลักสูตรบัญชีบัณฑิต (บช.บ.) 4 ปี--สาขาวิชาการบัญชี', 'อาจารย์เกศนี  จึงวัฒนตระกูล', '005843', '', '20032025090755.png', '2025-03-20 02:07:55', '2/2567'),
(19, '01', 'หลักสูตรบัญชีบัณฑิต (บช.บ.) 4 ปี--สาขาวิชาการบัญชี', 'ผู้ช่วยศาสตราจารย์อำภาภัทร์  วสันต์สกุล', '005837', '', '20032025090738.png', '2025-03-20 02:07:38', '2/2567'),
(20, '01', 'หลักสูตรบัญชีบัณฑิต (บช.บ.) 4 ปี--สาขาวิชาการบัญชี', 'อาจารย์เพลินพิศ  โพธิ์วัน', '005839', '', '20032025090725.png', '2025-03-20 02:07:25', '2/2567'),
(21, '01', 'หลักสูตรบัญชีบัณฑิต (บช.บ.) 4 ปี--สาขาวิชาการบัญชี', 'อาจารย์สัญญา  เนียมเปรม', '006653', '', '20032025090646.png', '2025-03-20 02:06:46', '2/2567'),
(22, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาคอมพิวเตอร์ธุรกิจดิจิทัล', 'ผู้ช่วยศาสตราจารย์ ดร.ชรินทร์ญา  หวังวัชรกุล', '004119', '', '20032025090630.png', '2025-03-20 02:06:30', '2/2567'),
(23, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาคอมพิวเตอร์ธุรกิจดิจิทัล', 'ผู้ช่วยศาสตราจารย์ณิชนันทน์  จงใจสิทธิ์', '005842', '', '', '2025-03-19 08:47:00', '2/2567'),
(24, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาคอมพิวเตอร์ธุรกิจดิจิทัล', 'อาจารย์ภัทร์ณัฐสุดา  จารุธีรพันธ์ุ', '005741', '', '20032025090517.png', '2025-03-20 02:05:17', '2/2567'),
(25, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาคอมพิวเตอร์ธุรกิจดิจิทัล', 'อาจารย์วรกร  พิมพาคุณ', '006483', '', '20032025090452.png', '2025-03-20 02:04:52', '2/2567'),
(26, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการตลาดดิจิทัล', 'ผู้ช่วยศาสตราจารย์ ดร.จารุพร  มีทรัพย์ทอง', '005841', '', '20032025090433.png', '2025-03-20 02:04:33', '2/2567'),
(27, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการตลาดดิจิทัล', 'อาจารย์อรจิต  ชัชวาลย์', '005833', '', '20032025090353.png', '2025-03-20 02:03:53', '2/2567'),
(28, '01', 'หลักสูตรบัญชีบัณฑิต (บช.บ.) 4 ปี--สาขาวิชาการบัญชี', 'อาจารย์ขนิษฐา  หาระคุณ', '004118', '', '20032025090319.png', '2025-03-20 02:03:19', '2/2567'),
(29, '01', 'หลักสูตรนิเทศศาสตรบัณฑิต (นศ.บ.) 4 ปี--สาขาวิชานิเทศศาสตร์ดิจิทัล', 'ผู้ช่วยศาสตราจารย์ ดร.ประยุทธ  วรรณอุดม', '004113', '', '20032025090302.jpg', '2025-03-20 02:03:02', '2/2567'),
(30, '01', 'หลักสูตรนิเทศศาสตรบัณฑิต (นศ.บ.) 4 ปี--สาขาวิชานิเทศศาสตร์ดิจิทัล', 'ดร.ณัฐฐิญา  ทรัพย์ปุญญากุล', '004114', '', '20032025090244.jpg', '2025-03-20 02:02:44', '2/2567'),
(31, '01', 'หลักสูตรนิเทศศาสตรบัณฑิต (นศ.บ.) 4 ปี--สาขาวิชานิเทศศาสตร์ดิจิทัล', 'อาจารย์พิชญา  ขุนศรี', '006650', '', '20032025090228.jpg', '2025-03-20 02:02:28', '2/2567'),
(32, '01', 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) 4 ปี--สาขาวิชาการท่องเที่ยวและการโรงแรม', 'ดร.วิศิษฐ์ศิริ  ชูสกุล', '005865', '', '20032025090213.png', '2025-03-20 02:02:13', '2/2567'),
(33, '01', 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) 4 ปี--สาขาวิชาการท่องเที่ยวและการโรงแรม', 'อาจารย์ปรียาพร  พิชิตตรานนท์', '005844', '', '20032025090126.png', '2025-03-20 02:01:26', '2/2567'),
(34, '01', 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) 4 ปี--สาขาวิชาการท่องเที่ยวและการโรงแรม', 'ดร.วรากรณ์  ใจน้อย', '005742', '', '20032025090058.png', '2025-03-20 02:00:58', '2/2567'),
(35, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการโลจิสติกส์และซัพพลายเชน', 'อาจารย์ภัชธีญา  บุญฤทธิ์', '004123', '', '20032025090034.png', '2025-03-20 02:00:34', '2/2567'),
(36, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการโลจิสติกส์และซัพพลายเชน', 'อาจารย์ณปาล  อุทยารัตน์', '005838', '', '20032025090016.png', '2025-03-20 02:00:16', '2/2567'),
(37, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการโลจิสติกส์และซัพพลายเชน', 'อาจารย์ไพโรจน์  ชัชวาลย์', '005867', '', '20032025090000.png', '2025-03-20 02:00:00', '2/2567'),
(38, '01', 'หลักสูตรบริหารธุรกิจบัณฑิต (บธ.บ.) 4 ปี--สาขาวิชาการจัดการโลจิสติกส์และซัพพลายเชน', 'อาจารย์รดาศา  เนตรแสงสี', '005716', '', '20032025085942.png', '2025-03-20 01:59:42', '2/2567'),
(39, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาวิทยาศาสตร์ชีวภาพ', 'นางสาวพันธ์ทิวา  กระจาย', 'สสศท. 002856', '', '20032025105856.jpeg', '2025-03-20 03:58:56', '2/2567'),
(40, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาวิทยาศาสตร์ชีวภาพ', 'นางสาวเนตรนภา  เกล็ดจีน', 'สสศท. 002755', '', '20032025105929.jpeg', '2025-03-20 03:59:29', '2/2567'),
(41, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาเคมีประยุกต์', 'ผศ.นภัสสร  วงเปรียว', 'สสศท. 002841', '', '20032025110032.jpg', '2025-03-20 04:00:32', '2/2567'),
(42, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาฟิสิกส์', 'ผศ.ดร.นุวัติ  พิมพะบุตร', 'สสศท. 003138', '', '20032025110104.jpeg', '2025-03-20 04:01:04', '2/2567'),
(43, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาฟิสิกส์', 'นายวีรชน  มีฐาน', 'สสศท. 002873', '', '20032025110130.jpeg', '2025-03-20 04:01:30', '2/2567'),
(44, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาคณิตศาสตร์', 'ผศ.ดร.มนตรี  ต่อวัฒนบุญ', 'สสศท. 002859', '', '20032025110209.jpeg', '2025-03-20 04:02:09', '2/2567'),
(45, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาคณิตศาสตร์', 'นายวิสุทธิ์  กิจชัยนุกูล', 'สสศท. 003181', '', '20032025110246.jpeg', '2025-03-20 04:02:46', '2/2567'),
(46, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาอาหารและโภชนาการ', 'ผศ.สุระเดช  ไชยตอกเกี้ย', 'สสศท. 002885', '', '20032025110310.jpeg', '2025-03-20 04:03:10', '2/2567'),
(47, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาวิทยาศาสตร์และเทคโนโลยีสิ่งแวดล้อม', 'ผศ.ดร.วัลลภ  ทาทอง', 'สสศท. 002867', '', '20032025110343.jpeg', '2025-03-20 04:03:43', '2/2567'),
(48, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาวิทยาศาสตร์และเทคโนโลยีสิ่งแวดล้อม', 'นางสาวกานดา  ปุ่มสิน', 'สสศท. 003080', '', '20032025110411.jpeg', '2025-03-20 04:04:11', '2/2567'),
(49, '02', 'หลักสูตรสาธารณสุขศาสตรบัณฑิต (ส.บ.) 4 ปี--สาขาวิชาสาธารณสุขศาสตร์', 'ผศ.นพวรรณ  ดวงหัสดี', 'สสศท. 002840', '', '20032025110441.jpg', '2025-03-20 04:04:41', '2/2567'),
(50, '02', 'หลักสูตรสาธารณสุขศาสตรบัณฑิต (ส.บ.) 4 ปี--สาขาวิชาสาธารณสุขศาสตร์', 'ดร.รุ่งกานต์  อินทวงศ์', 'สสศท. 002779', '', '20032025110525.jpg', '2025-03-20 04:05:25', '2/2567'),
(51, '02', 'หลักสูตรวิทยาศาสตรบัณฑิต (วท.บ.) 4 ปี--สาขาวิชาเกษตรศาสตร์', 'นายนิธิภัทร  บุญปก', 'สสศท. 002845', '', '20032025110552.jpeg', '2025-03-20 04:05:52', '2/2567');

-- --------------------------------------------------------

--
-- Table structure for table `organization`
--

CREATE TABLE `organization` (
  `id` int(11) NOT NULL,
  `name` varchar(250) NOT NULL,
  `address` varchar(250) NOT NULL,
  `subdistrict` varchar(100) NOT NULL,
  `district` varchar(100) NOT NULL,
  `province` varchar(100) NOT NULL,
  `postcode` varchar(100) NOT NULL,
  `tel1` varchar(20) NOT NULL,
  `tel2` varchar(20) NOT NULL,
  `fax` varchar(20) NOT NULL,
  `line` varchar(20) NOT NULL,
  `facebook` varchar(100) NOT NULL,
  `website` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `logo` varchar(100) NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `post_by` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `organization_mou`
--

CREATE TABLE `organization_mou` (
  `id` int(11) NOT NULL,
  `faculty_id` varchar(10) NOT NULL,
  `name` varchar(250) NOT NULL,
  `address` varchar(250) NOT NULL,
  `subdistrict` varchar(100) NOT NULL,
  `district` varchar(100) NOT NULL,
  `province` varchar(100) NOT NULL,
  `postcode` varchar(100) NOT NULL,
  `date_mou` varchar(100) NOT NULL,
  `time_mou` varchar(100) NOT NULL,
  `note` varchar(250) NOT NULL,
  `tel1` varchar(20) NOT NULL,
  `tel2` varchar(20) NOT NULL,
  `fax` varchar(20) NOT NULL,
  `line` varchar(20) NOT NULL,
  `facebook` varchar(100) NOT NULL,
  `website` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `post_by` varchar(100) NOT NULL,
  `year` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `organization_mou`
--

INSERT INTO `organization_mou` (`id`, `faculty_id`, `name`, `address`, `subdistrict`, `district`, `province`, `postcode`, `date_mou`, `time_mou`, `note`, `tel1`, `tel2`, `fax`, `line`, `facebook`, `website`, `email`, `date_regis`, `post_by`, `year`) VALUES
(1, '02', 'บริษัท ดี อินเทลลิเจ็นซ์ จำกัด', '415, 415/1-11 ซอยลาดพร้าว 1222  (มหาดไทย 1) ', 'แขวงพลับพลา ', 'เขตวังทองหลาง ', 'กรุงเทพมหานคร', '10310', '11 มกราคม 2564', '5', '', '', '', '', '', '', '', '', '2025-03-14 08:40:27', 'ประเสริฐ ลูกแก้ว', '2/2567'),
(2, '02', 'บริษัท เอเซีย โซไซตี้ฟิตเนส จำกัด', '393 ถนนราษฎร์พัฒนา ', 'แขวงบางปะกอก  ', 'เขตราษฎร์บูรณะ', 'กรุงเทพมหานคร', '10140', '13 มกราคม 2564', '5', '', '', '', '', '', '', '', '', '2025-03-14 08:41:56', 'ประเสริฐ ลูกแก้ว', '2/2567'),
(3, '02', 'บริษัท  ไลค์ มี เอ็กซ์  จำกัด', '264/149 ซอยเทียนทะเล 19 ถนนบางขุนเทียน-ชายทะเล  ', 'แขวงท่าข้าม ', 'เขตบางขุนเทียน ', 'กรุงเทพมหานคร', '10150', '3 สิงหาคม 2565', '3', '', '', '', '', '', '', '', '', '2025-03-14 08:46:33', 'ประเสริฐ ลูกแก้ว', '2/2567'),
(4, '02', 'องค์การบริหารส่วนจังหวัดขอนแก่น', 'ถนนหน้าเมือง', ' ตำบลในเมือง ', 'อำเภอเมืองขอนแก่น ', 'ขอนแก่น', '40000', '7 กันยายน 2565', '3', '', '', '', '', '', '', '', '', '2025-03-14 08:47:58', 'ประเสริฐ ลูกแก้ว', '2/2567'),
(5, '', 'บริษัท ซี.ซี.คอนกรีต จำกัด', '178', 'นาโป่ง', 'เมืองเลย', 'เลย', '42000', '10 สิงหาคม 2566', '5', '', '0819648411', '', '', '', '', '', '', '2025-03-19 05:55:40', '', '2/2567'),
(6, '03', 'บริษัท ซี.ซี.คอนกรีต จำกัด', '178', 'นาโป่ง', 'เมืองเลย', 'เลย', '42000', '10 สิงหาคม 2566', '5', '', '0819648411', '', '', '', '', '', '', '2025-03-19 05:56:57', 'ทัศนีย์ บุตรเพ็ง', '2/2567'),
(7, '03', 'บริษัท ไจแอนด์ ร็อค 1990 จำกัด', '188', 'เอราวัณ', 'เอราวัณ', 'เลย', '42000', '10 สิงหาคม 2566', '5', '', '0864513755', '', '', '', '', '', '', '2025-03-19 05:58:30', 'ทัศนีย์ บุตรเพ็ง', '2/2567'),
(8, '03', 'บริษัท เยนเนอรัล อินทรูเม้นท์ จำกัด', '68/777', 'บ้านใหม่', 'ปากเกร็ด', 'นนทบุรี', '11120', '1 มิถุนายน 2566', '5', '', '020902447', '', '', '', '', '', '', '2025-03-19 06:00:26', 'ทัศนีย์ บุตรเพ็ง', '2/2567'),
(9, '01', 'สหกรณ์การเกษตร กรป.กลาง นพค.เลย จำกัด', '415 หมู่ที่ 1', 'ปากชม', 'ปากชม', 'เลย', '42150', '26 สิงหาคม 2567', '5', '', '', '', '', '', '', '', '', '2025-03-19 07:53:48', 'นางสาวเกศฤทัย  ศรีสุทร', '2/2567'),
(10, '01', 'บริษัท นิว เจ็น แอคเคาน์ติ้ง แอนด์ บิสซิเนส จำกัด', '64/9 หมู่่ที่ 11', 'เมืองเก่า', 'เมืองขอนแก่น', 'ขอนแก่น', '', 'วันที่ เดือน ปี พ.ศ.', '', '', '0648722288', '', '043-224044', '', '', '', '', '2025-03-19 07:57:28', 'นางสาวเกศฤทัย  ศรีสุทร', '2/2567'),
(11, '01', 'บริษัท สำนักงานบัญชีขอนแก่น จำกัด', '289/1 หมู่ที่ 26', 'ศิลา', 'เมือง', 'ขอนแก่น', '', '20 กันยายน 2566', '5', '', '06-5627-4268', '', '', '', '', '', '', '2025-03-19 08:00:10', 'นางสาวเกศฤทัย  ศรีสุทร', '2/2567'),
(12, '01', 'บริษัท เก่งเว็บ ดอทคอม จำกัด', '188/1 หมู่ 19 ถนนมิตรภาพ-บ้านกอก', 'บ้านเป็ด', 'เมืองขอนแก่น', 'ขอนแก่น', '40000', '30 มกราคม 2568', '5', '', '08-6900-0044', '', '', '', '', '', '', '2025-03-19 08:07:00', 'นางสาวเกศฤทัย  ศรีสุทร', '2/2567'),
(13, '01', 'บริษัท ออร่า ริช (ประเทศไทย) จำกัด', '456/8 หมู่ที่ 2', 'บ้านเป็ด', 'เมืองขอนแก่น', 'ขอนแก่น', '40000', '30 มกราคม 2568', '5', '', '', '', '', '', '', '', '', '2025-03-19 08:06:40', 'นางสาวเกศฤทัย  ศรีสุทร', '2/2567'),
(14, '01', 'บริษัท คลีนิคสุขภัณฑ์ จำกัด', '373 ถนนมหาพฤฒาราม', 'มหาพฤฒาราม', 'บางรัก', 'กรุงเทพมหานคร', '10500', '30 มกราคม 2568', '5', '', '', '', '', '', '', '', '', '2025-03-19 08:08:23', 'นางสาวเกศฤทัย  ศรีสุทร', '2/2567'),
(15, '01', 'บริษัท อีเค เน็ตเวิร์ค จำกัด', '353/198 หมู่บ้านรัตนาธานี', 'บ้านเป็ด', 'เมืองขอนแก่น', 'ขอนแก่น', '40000', '30 มกราคม 2568', '5', '', '', '', '', '', '', '', '', '2025-03-19 08:09:22', 'นางสาวเกศฤทัย  ศรีสุทร', '2/2567'),
(16, '01', 'บริษัท แอดไวซ์ ไอที มอเลย จำกัด', '115 หมู่ที่ 11 ะนนเลย-เชียงคาน', 'เมือง', 'เมืองเลย', 'เลย', '42000', '30 มกราคม 2568', '5', '', '042-834880', '', '', '', '', '', '', '2025-03-19 08:10:46', 'นางสาวเกศฤทัย  ศรีสุทร', '2/2567'),
(17, '01', 'บริษัท ชิฟท์ซอฟท์ จำกัด', '111/40 ซอยโพธิ์แก้ว แยก 13 ', 'นวมินทร์', 'บึงกุ่ม', 'กรุงเทพมหานคร', '10240', '30 มกราคม 2568', '5', '', '02-9483-6701', '', '', '', '', '', '', '2025-03-19 08:11:59', 'นางสาวเกศฤทัย  ศรีสุทร', '2/2567'),
(18, '01', 'บริษัท ฮอนด้าเมืองเลย จำกัด', '28 ถนนชุมสาย', 'กุดป่อง', 'เมืองเลย', 'เลย', '42000', '14 พฤศจิกายน 2566', '5', '', '09-54390525', '', '', '', '', '', '', '2025-03-19 08:13:06', 'นางสาวเกศฤทัย  ศรีสุทร', '2/2567'),
(19, '01', 'ร้านมีดีไซน์', '23/27 ถนนมะลิวัลย์', 'กุดป่อง', 'เมืองเลย', 'เลย', '42000', '30 มกราคม 2568', '5', '', '08-1505-9569', '', '', '', '', '', '', '2025-03-19 08:15:19', 'นางสาวเกศฤทัย  ศรีสุทร', '2/2567');

-- --------------------------------------------------------

--
-- Table structure for table `semester`
--

CREATE TABLE `semester` (
  `id` int(10) NOT NULL,
  `semester` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `semester`
--

INSERT INTO `semester` (`id`, `semester`) VALUES
(1, '1/2564'),
(2, '2/2564'),
(3, '1/2565'),
(4, '2/2565'),
(5, '1/2566'),
(6, '2/2566');

-- --------------------------------------------------------

--
-- Table structure for table `stu_highlight`
--

CREATE TABLE `stu_highlight` (
  `id` int(10) NOT NULL,
  `name` varchar(100) NOT NULL,
  `faculty` varchar(100) NOT NULL,
  `highlight` varchar(100) NOT NULL,
  `filename` varchar(100) NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `stu_highlight`
--

INSERT INTO `stu_highlight` (`id`, `name`, `faculty`, `highlight`, `filename`, `date_regis`) VALUES
(1, 'aa', 'aa', 'aa', 'aa', '2023-09-15 08:36:57'),
(2, 'dd', 'dd', 'dd', '', '2023-09-15 08:45:23'),
(3, 'ออ', '', 'ออ', '', '2023-09-15 08:46:47'),
(4, 'พพ', '01', 'พพ', '', '2023-09-15 08:47:21'),
(5, 'ผผ', 'คณะวิทยาศาสตร์และเทคโนโลยี', 'ผผ', '', '2023-09-15 08:47:58'),
(6, 'มม', 'คณะเทคโนโลยีอุตสาหกรรม', 'มม', '15092023155205.jpeg', '2023-09-15 08:52:05'),
(7, 'นายสังสรรค์ หล้าพันธ์', 'คณะวิทยาศาสตร์และเทคโนโลยี', 'Full Stack Developer', '15092023161403.jpg', '2023-09-15 09:14:03'),
(8, 'นายสุภกิจ นามจินดา', 'คณะวิทยาการจัดการ', 'Business Partner', '15092023163746.jpg', '2023-09-15 09:37:46');

-- --------------------------------------------------------

--
-- Table structure for table `tblstudent`
--

CREATE TABLE `tblstudent` (
  `id` int(10) NOT NULL,
  `faculty` varchar(100) NOT NULL,
  `field` varchar(255) NOT NULL,
  `sec` varchar(100) NOT NULL,
  `student_id` varchar(10) NOT NULL,
  `name` varchar(255) NOT NULL,
  `pass` varchar(100) NOT NULL,
  `img` varchar(100) NOT NULL,
  `status` varchar(1) NOT NULL,
  `regdate` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `tblstudent`
--

INSERT INTO `tblstudent` (`id`, `faculty`, `field`, `sec`, `student_id`, `name`, `pass`, `img`, `status`, `regdate`) VALUES
(1, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267101', 'นางสาวกติกา จำปาขาว', '2880eec53bbe0e7a4e85eee4809b297d', '', '1', '2022-06-02 23:14:43'),
(2, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267102', 'นางสาวกัลยาณี ชนชิต', 'e6cb7efe98f71e4b9f1a351ea0f93231', '', '1', '2022-06-14 15:37:15'),
(3, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267103', 'นางสาวเกณิกา ศิริแว่น', 'eacc84fcb08b94bf920584a0a3ace9bf', '', '1', '2022-06-26 14:41:02'),
(4, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267104', 'นายจิตรกร สรณ์คูณแก้ว', '21fc187c5f69f46c9855d2543c984177', '', '1', '2022-07-01 06:48:18'),
(5, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267105', 'นางสาวชลดา ทองเดช', '1238', '', '1', '2022-05-29 15:16:57'),
(6, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267107', 'นางสาวทัชชา ปัชชามาตย์', '1239', '', '1', '2022-05-29 15:16:57'),
(7, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267108', 'นางสาวธนารี การบรรจง', '1240', '', '1', '2022-05-29 15:16:57'),
(8, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267109', 'นายธีรพัฒน์ สุภาพ', '1241', '', '1', '2022-05-29 15:16:57'),
(9, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267110', 'นางสาวนาตยา สุดรัก', '1242', '', '1', '2022-05-29 15:16:57'),
(10, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267111', 'นางสาวปนัดดา สาลาสุตา', '1243', '', '1', '2022-05-29 15:16:57'),
(11, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267112', 'นางสาวปาริชาต เอสันเทียะ', '1244', '', '1', '2022-05-29 15:16:57'),
(12, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267113', 'นางสาวพลอยวรรณ อักษรไทย', '1245', '', '1', '2022-05-29 15:16:57'),
(13, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267114', 'นางสาวพัชริน โก้งดี', '1246', '', '1', '2022-05-29 15:16:57'),
(14, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267115', 'นางสาวพิมลวรรณ สุพะสอน', '1247', '', '1', '2022-05-29 15:16:57'),
(15, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267116', 'นางสาวไพลิน อาจมนตรี', '1248', '', '1', '2022-05-29 15:16:57'),
(16, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267117', 'นางสาวภิญญาพัชญ์ วงค์พยัคฆ์', '1249', '', '1', '2022-05-29 15:16:57'),
(17, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267118', 'นางสาวมณีรัตน์ บำรุงสำราญ', '1250', '', '1', '2022-05-29 15:16:57'),
(18, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267119', 'นายยุทธภัณฑ์ ขัติสอน', '1251', '', '1', '2022-05-29 15:16:57'),
(19, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267120', 'นางสาวฤทัยรัตน์ มณีจักร์', '1252', '', '1', '2022-05-29 15:16:57'),
(20, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267121', 'นางสาววราภรณ์ เพ็งรัตน์', '1253', '', '1', '2022-05-29 15:16:57'),
(21, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267122', 'นายวันเฉลิม วรรณไชย', '1254', '', '1', '2022-05-29 15:16:57'),
(22, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267123', 'นางสาววันวิสา สุวรรณสิงห์', '1255', '', '1', '2022-05-29 15:16:57'),
(23, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267124', 'นางสาวศศิธร จันศรี', '1256', '', '1', '2022-05-29 15:16:57'),
(24, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267125', 'นางสาวส่องจันทร์ เสมบาง', '1257', '', '1', '2022-05-29 15:16:57'),
(25, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267126', 'นางสาวสิรินดา กุลกั้ง', '1258', '', '1', '2022-05-29 15:16:57'),
(26, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267127', 'นางสาวสุกัญญา พรมมานอก', '1259', '', '1', '2022-05-29 15:16:57'),
(27, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267128', 'นางสาวสุดารัตน์ วันทองสุข', '1260', '', '1', '2022-05-29 15:16:57'),
(28, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267129', 'นางสาวสุภารัตน์ ฮาดวิเศษ', '1261', '', '1', '2022-05-29 15:16:57'),
(29, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267130', 'นางสาวสุวัจนี ทองภา', '1262', '', '1', '2022-05-29 15:16:57'),
(30, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267131', 'นายอริยชนม์ ฤทธิ์รังษีโสภณ', '1263', '', '1', '2022-05-29 15:16:57'),
(31, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267133', 'นางสาวอารียา คงไมตรี', '1264', '', '1', '2022-05-29 15:16:57'),
(32, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267134', 'นางสาวธิติญา เหล่าหว้าน', '1265', '', '1', '2022-05-29 15:16:57'),
(33, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267135', 'นางสาวภิญญาภรณ์ โอนทองหลาง', '1266', '', '1', '2022-05-29 15:16:57'),
(34, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267136', 'นายภูวนารถ แก้วพรม', '1267', '', '1', '2022-05-29 15:16:57'),
(35, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267137', 'นางสาววิลาวรรณ สิทธิเสนา', '1268', '', '1', '2022-05-29 15:16:57'),
(36, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6201', '6240267138', 'นางสาวพิมวิภา ต้นพนม', '1269', '', '1', '2022-05-29 15:16:57'),
(37, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267201', 'นางสาวกัญญารัตน์ อิ่มชมชื่น', '1270', '', '1', '2022-05-29 15:16:57'),
(38, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267202', 'นางสาวกิ่งแก้ว ก้งซุย', '1271', '', '1', '2022-05-29 15:16:57'),
(39, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267203', 'นางสาวจณิสตา ขันแก้ว', '1272', '', '1', '2022-05-29 15:16:57'),
(40, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267204', 'นางสาวจุธาภัค รัตนวงศ์', '1273', '', '1', '2022-05-29 15:16:57'),
(41, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267205', 'นางสาวชลดา พุทธรา', '1274', '', '1', '2022-05-29 15:16:57'),
(42, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267206', 'นางสาวดวงจันทร์ ทองแดนไทย', '1275', '', '1', '2022-05-29 15:16:57'),
(43, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267207', 'นางสาวธนพร วันมะโน', '1276', '', '1', '2022-05-29 15:16:57'),
(44, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267208', 'นางสาวธันวารักษ์ วรรณชัย', '1277', '', '1', '2022-05-29 15:16:57'),
(45, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267209', 'นายนรินทร์ธร ภิรมย์ราช', '1278', '', '1', '2022-05-29 15:16:57'),
(46, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267210', 'นางสาวนุชบา สากองสี', '1279', '', '1', '2022-05-29 15:16:57'),
(47, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267211', 'นางสาวปภาวดี อุนทะพา', '1280', '', '1', '2022-05-29 15:16:57'),
(48, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267212', 'นางสาวปิยนันท์ อาจหาญ', '1281', '', '1', '2022-05-29 15:16:57'),
(49, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267215', 'นางสาวแพรวนภา คำมูล', '1282', '', '1', '2022-05-29 15:16:57'),
(50, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267216', 'นางสาวภาวิณีษ์ โททองดี', '1283', '', '1', '2022-05-29 15:16:57'),
(51, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267218', 'นางสาวมาริสา ศรีจันทะ', '1284', '', '1', '2022-05-29 15:16:57'),
(52, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267219', 'นางสาวยุวดี หงษาแก้ว', '1285', '', '1', '2022-05-29 15:16:57'),
(53, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267220', 'นางสาววรรณทิรา ประทุมชัย', '1286', '', '1', '2022-05-29 15:16:57'),
(54, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267222', 'นางสาววันวิสา แย้มฎีกา', '1287', '', '1', '2022-05-29 15:16:57'),
(55, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267223', 'นางสาววิจิตตรา เถาเมฆ', '1288', '', '1', '2022-05-29 15:16:57'),
(56, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267224', 'นางสาวสลิลทิพย์ สีสุข', '1289', '', '1', '2022-05-29 15:16:57'),
(57, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267225', 'นางสาวสิริฉัตร พรหมพัฒน์', '1290', '', '1', '2022-05-29 15:16:57'),
(58, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267227', 'นางสาวสุดารัตน์ โกฏิรักษ์', '1291', '', '1', '2022-05-29 15:16:57'),
(59, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267228', 'นางสาวสุนันทา ดอนแสง', '1292', '', '1', '2022-05-29 15:16:57'),
(60, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267229', 'นางสาวสุภาวดี สุวรรณคร', '1293', '', '1', '2022-05-29 15:16:57'),
(61, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267230', 'นางสาวอภิชญา ปักกะทานัง', '1294', '', '1', '2022-05-29 15:16:57'),
(62, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267231', 'นางสาวอริสรา วิญวิสนุรักร์', '1295', '', '1', '2022-05-29 15:16:57'),
(63, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267232', 'นางสาวอัฐภิญญา เจริญขวัญ', '1296', '', '1', '2022-05-29 15:16:57'),
(64, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267233', 'นางสาวอารีรักษ์ โพธิ์ศรี', '1297', '', '1', '2022-05-29 15:16:57'),
(65, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267234', 'นายธวัชชัย ด่านส่งเสบียง', '1298', '', '1', '2022-05-29 15:16:57'),
(66, 'วิทยาศาสตร์และเทคโนโลยี', 'สาธารณสุขศาสตร์', 'ว.6202', '6240267235', 'นางสาวชนรดี มุ่งเครือกลาง', '1299', '', '1', '2022-05-29 15:16:57'),
(67, 'วิทยาศาสตร์และเทคโนโลยี', 'เคมี', 'ว.6214', '6240280101', 'นางสาวธีราภรณ์ โสหะ', '1300', '', '1', '2022-05-29 15:16:57'),
(68, 'วิทยาศาสตร์และเทคโนโลยี', 'เคมี', 'ว.6214', '6240280102', 'นางสาวปริศนา ขามก้อน', '1301', '', '1', '2022-05-29 15:16:57'),
(69, 'วิทยาศาสตร์และเทคโนโลยี', 'เคมี', 'ว.6214', '6240280103', 'นางสาวโยธกา ไชยคีนี', '1302', '', '1', '2022-05-29 15:16:57'),
(70, 'วิทยาศาสตร์และเทคโนโลยี', 'เคมี', 'ว.6214', '6240280106', 'นายสุทธิกันต์ หอมคำพัด', '1303', '', '1', '2022-05-29 15:16:57'),
(71, 'วิทยาศาสตร์และเทคโนโลยี', 'เคมี', 'ว.6214', '6240280107', 'นางสาวอารีวรรณ นาคนชม', '1304', '', '1', '2022-05-29 15:16:57'),
(72, 'วิทยาศาสตร์และเทคโนโลยี', 'เคมี', 'ว.6214', '6240280108', 'นางสาวสุวรรณณี หอมสมบัติ', '1305', '', '1', '2022-05-29 15:16:57'),
(73, 'วิทยาศาสตร์และเทคโนโลยี', 'ฟิสิกส์', 'ว.6213', '6240243101', 'นายณรงค์ศักดิ์ สอนสุภาพ', '1306', '', '1', '2022-05-29 15:16:57'),
(74, 'วิทยาศาสตร์และเทคโนโลยี', 'ฟิสิกส์', 'ว.6213', '6240243103', 'นายพีรภัทร สุ่มมาตร์', '1307', '', '1', '2022-05-29 15:16:57'),
(75, 'วิทยาศาสตร์และเทคโนโลยี', 'ฟิสิกส์', 'ว.6213', '6240243104', 'นางสาวเพ็ญประภา ฝากเซียงซา', '1308', '', '1', '2022-05-29 15:16:57'),
(76, 'วิทยาศาสตร์และเทคโนโลยี', 'ฟิสิกส์', 'ว.6213', '6240243106', 'นางสาวสุธิตรา บุญทรัพย์', '1309', '', '1', '2022-05-29 15:16:57'),
(77, 'วิทยาศาสตร์และเทคโนโลยี', 'ฟิสิกส์', 'ว.6213', '6240243108', 'นางสาวอาทิตยา ดูลา', '1310', '', '1', '2022-05-29 15:16:57'),
(78, 'วิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'ว.6204', '6240242102', 'นางสาวขวัญแก้ว ศรีอุดร', '1311', '', '1', '2022-05-29 15:16:57'),
(79, 'วิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'ว.6204', '6240242103', 'นางสาวจุฑามณี อ่อนบุญ', '1312', '', '1', '2022-05-29 15:16:57'),
(80, 'วิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'ว.6204', '6240242104', 'นายชาญวุฒิ สุขกาวงค์', '1313', '', '1', '2022-05-29 15:16:57'),
(81, 'วิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'ว.6204', '6240242105', 'นางสาวฐิติมา สุภาพรหม', '1314', '', '1', '2022-05-29 15:16:57'),
(82, 'วิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'ว.6204', '6240242106', 'นางสาวกวินธิดา หมื่นจิตร', '1315', '', '1', '2022-05-29 15:16:57'),
(83, 'วิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'ว.6204', '6240242109', 'นางสาวลาวัลย์ โสภณพงษ์', '1316', '', '1', '2022-05-29 15:16:57'),
(84, 'วิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'ว.6204', '6240242110', 'นางสาววรรณิดา สายคำภา', '1317', '', '1', '2022-05-29 15:16:57'),
(85, 'วิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'ว.6204', '6240242111', 'นางสาววิชุดา นะรากุล', '1318', '', '1', '2022-05-29 15:16:57'),
(86, 'วิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'ว.6204', '6240242113', 'นางสาวศุภิสรา พระคุณ', '1319', '', '1', '2022-05-29 15:16:57'),
(87, 'วิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'ว.6204', '6240242114', 'นางสาวสุทธิดา แก้วไพฑูรย์', '1320', '', '1', '2022-05-29 15:16:57'),
(88, 'วิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'ว.6204', '6240242117', 'นางสาวสุนิสา สุวรรณสิงห์', '1321', '', '1', '2022-05-29 15:16:57'),
(89, 'วิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'ว.6204', '6240242118', 'นางสาวแสงทอง เหล่าคำ', '1322', '', '1', '2022-05-29 15:16:57'),
(90, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248102', 'นายเกรียงศักดิ์ อินถวัลย์', '1323', '', '1', '2022-05-29 15:16:57'),
(91, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248103', 'นายชนาธิป เพชรราชา', '1324', '', '1', '2022-05-29 15:16:57'),
(92, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248104', 'นายชัชชัย ศรีสวัสดิ์', '1325', '', '1', '2022-05-29 15:16:57'),
(93, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248105', 'นายณัฐมงคล มกรกุล', '1326', '', '1', '2022-05-29 15:16:57'),
(94, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248106', 'นายพชรพล ษรจันทร์ศรี', '1327', '', '1', '2022-05-29 15:16:57'),
(95, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248107', 'นางสาวยุวรรณธิดา ทุมดี', '1328', '', '1', '2022-05-29 15:16:57'),
(96, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248109', 'นายวิชาญ แดงตาโคตร', '1329', '', '1', '2022-05-29 15:16:57'),
(97, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248112', 'นายสุรศักดิ์ จ่อยลา', '1330', '', '1', '2022-05-29 15:16:57'),
(98, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248113', 'นางสาวสุวนิดา ท่าน้ำ', '1331', '', '1', '2022-05-29 15:16:57'),
(99, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248114', 'นางสาวอภิภาวดี แก้วเบ้า', '1332', '', '1', '2022-05-29 15:16:57'),
(100, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248115', 'นายอัฐพล พลฤทธิ์', '1333', '', '1', '2022-05-29 15:16:57'),
(101, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248116', 'นายชานนท์ แก้วพรหม', '1334', '', '1', '2022-05-29 15:16:57'),
(102, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248117', 'นายอรัญธรรม โมกไธสง', '1335', '', '1', '2022-05-29 15:16:57'),
(103, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6205', '6240248118', 'นางสาวอารียา พรมนอก', '1336', '', '1', '2022-05-29 15:16:57'),
(104, 'วิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'ว.6206', '6240259101', 'นายกัมปนาท ศิลาเลิศ', '1337', '', '1', '2022-05-29 15:16:57'),
(105, 'วิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'ว.6206', '6240259102', 'นางสาวเกษสุภัค เนตรสุวรรณ', '1338', '', '1', '2022-05-29 15:16:57'),
(106, 'วิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'ว.6206', '6240259103', 'นายจักรกฤษณ์ เลิศอุดมโชค', '1339', '', '1', '2022-05-29 15:16:57'),
(107, 'วิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'ว.6206', '6240259104', 'นายไตรภพ คำสุขดี', '1340', '', '1', '2022-05-29 15:16:57'),
(108, 'วิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'ว.6206', '6240259106', 'นายธีรยุทธ พรสุขศิริ', '1341', '', '1', '2022-05-29 15:16:57'),
(109, 'วิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'ว.6206', '6240259107', 'นางสาวเปรมฤทัย พิมาน', '1342', '', '1', '2022-05-29 15:16:57'),
(110, 'วิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'ว.6206', '6240259108', 'นายภควัฒน์ ชัยมงคล', '1343', '', '1', '2022-05-29 15:16:57'),
(111, 'วิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'ว.6206', '6240259109', 'นายภัทรพล วงษาราช', '1344', '', '1', '2022-05-29 15:16:57'),
(112, 'วิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'ว.6206', '6240259112', 'นายสัตพล สุพรหมอินทร์', '1345', '', '1', '2022-05-29 15:16:57'),
(113, 'วิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'ว.6206', '6240259114', 'นายอดิศร โกษาจันทร์', '1346', '', '1', '2022-05-29 15:16:57'),
(114, 'วิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'ว.6206', '6240259115', 'นายอริยะ นามนัย', '1347', '', '1', '2022-05-29 15:16:57'),
(115, 'วิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'ว.6206', '6240259116', 'นายพัชรพล คุณาจ่าม', '1348', '', '1', '2022-05-29 15:16:57'),
(116, 'วิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', 'ว.6207', '6240250101', 'นางสาวกรรณิกรานต์ คชทิพ', '1349', '', '1', '2022-05-29 15:16:57'),
(117, 'วิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', 'ว.6207', '6240250102', 'นางสาวกรรณิการ์ บุญประคม', '1350', '', '1', '2022-05-29 15:16:57'),
(118, 'วิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', 'ว.6207', '6240250103', 'นางสาวจุฬาลักษณ์ มาผิว', '1351', '', '1', '2022-05-29 15:16:57'),
(119, 'วิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', 'ว.6207', '6240250104', 'นายชาญชล โยธี', '1352', '', '1', '2022-05-29 15:16:57'),
(120, 'วิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', 'ว.6207', '6240250105', 'นายธรรมรัฐ ศรีมงคล', '1353', '', '1', '2022-05-29 15:16:57'),
(121, 'วิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', 'ว.6207', '6240250107', 'นางสาวพรสวรรค์ แจ้งพันธ์', '1354', '', '1', '2022-05-29 15:16:57'),
(122, 'วิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', 'ว.6207', '6240250109', 'นางสาวรุ่งฤดี หล้าประเสริฐ', '1355', '', '1', '2022-05-29 15:16:57'),
(123, 'วิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', 'ว.6207', '6240250110', 'นางสาววรวลัญ ชัยภิบาล', '1356', '', '1', '2022-05-29 15:16:57'),
(124, 'วิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', 'ว.6207', '6240250112', 'นายวุฒิชัย คำใส', '1357', '', '1', '2022-05-29 15:16:57'),
(125, 'วิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', 'ว.6207', '6240250113', 'นางสาวศศิกานต์ ศิริชี', '1358', '', '1', '2022-05-29 15:16:57'),
(126, 'วิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', 'ว.6207', '6240250114', 'นายสุริยา พิมพันธ์', '1359', '', '1', '2022-05-29 15:16:57'),
(127, 'วิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', 'ว.6207', '6240250116', 'นายปฏิพล เหล็กแก้ว', '1360', '', '1', '2022-05-29 15:16:57'),
(128, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289102', 'นางสาวเกตมณี คำแดง', '1361', '', '1', '2022-05-29 15:16:57'),
(129, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289103', 'นายคณธร เจริญคุณ', '1362', '', '1', '2022-05-29 15:16:57'),
(130, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289104', 'นางสาวจิรวรรณ แก้วบุดดี', '1363', '', '1', '2022-05-29 15:16:57'),
(131, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289106', 'นางสาวชนิดา ที่พักบ้านโจด', '1364', '', '1', '2022-05-29 15:16:57'),
(132, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289107', 'นางสาวณิชาภัทร อุกแก้ว', '1365', '', '1', '2022-05-29 15:16:57'),
(133, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289108', 'นางสาวดาราวรรณ ไตรยวิภาค', '1366', '', '1', '2022-05-29 15:16:57'),
(134, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289109', 'นางสาวธัญญรัตน์ จตุเรศ', '1367', '', '1', '2022-05-29 15:16:57'),
(135, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289111', 'นางสาวนิลาวัลย์ จันทวี', '1368', '', '1', '2022-05-29 15:16:57'),
(136, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289112', 'นายปริญญา หาระบุตร', '1369', '', '1', '2022-05-29 15:16:57'),
(137, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289114', 'นางสาวพันธิตรา แอกทอง', '1370', '', '1', '2022-05-29 15:16:57'),
(138, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289116', 'นางสาววชิราภรณ์ ขวัญยืน', '1371', '', '1', '2022-05-29 15:16:57'),
(139, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289117', 'นางสาววรรณนิษา แสงหาญ', '1372', '', '1', '2022-05-29 15:16:57'),
(140, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289118', 'นางสาววรรณี พลซา', '1373', '', '1', '2022-05-29 15:16:57'),
(141, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289120', 'นางสาวศศิธร ธัญญะประกอบ', '1374', '', '1', '2022-05-29 15:16:57'),
(142, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289121', 'นางสาวศศินา บุญมีวิเศษ', '1375', '', '1', '2022-05-29 15:16:57'),
(143, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289122', 'นายศุภกิตติ์ หล้าพันธ์', '1376', '', '1', '2022-05-29 15:16:57'),
(144, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289123', 'นางสาวสร้อยสุดา สีหะ', '1377', '', '1', '2022-05-29 15:16:57'),
(145, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289124', 'นางสาวอริษา สมสุข', '1378', '', '1', '2022-05-29 15:16:57'),
(146, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289125', 'นางสาวแอนนา บุญศรี', '1379', '', '1', '2022-05-29 15:16:57'),
(147, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289127', 'นางสาวธนิษฐา โกทา', '1380', '', '1', '2022-05-29 15:16:57'),
(148, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289128', 'นายวิทวัส คุณประทุม', '1381', '', '1', '2022-05-29 15:16:57'),
(149, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289129', 'นางสาวนภาพร ทุมวงศ์', '1382', '', '1', '2022-05-29 15:16:57'),
(150, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289130', 'นางสาวพรธิดา โพธิราช', '1383', '', '1', '2022-05-29 15:16:57'),
(151, 'วิทยาศาสตร์และเทคโนโลยี', 'อาหารและโภชนาการ', 'ว.6208', '6240289131', 'นางสาวกาญจนา ถึงนอก', '1384', '', '1', '2022-05-29 15:16:57'),
(152, 'วิทยาศาสตร์และเทคโนโลยี', ' วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'ว.6215', '6240258102', 'นางสาวณัฐชนก จันทร์ดี', '1385', '', '1', '2022-05-29 15:16:57'),
(153, 'วิทยาศาสตร์และเทคโนโลยี', ' วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'ว.6215', '6240258103', 'นางสาวนริศรา ชมภู', '1386', '', '1', '2022-05-29 15:16:57'),
(154, 'วิทยาศาสตร์และเทคโนโลยี', ' วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'ว.6215', '6240258104', 'นางสาวปิยวรรณ ศรีบุรินทร์', '1387', '', '1', '2022-05-29 15:16:57'),
(155, 'วิทยาศาสตร์และเทคโนโลยี', ' วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'ว.6215', '6240258107', 'นางสาววรรณภา ป้องที', '1388', '', '1', '2022-05-29 15:16:57'),
(156, 'วิทยาศาสตร์และเทคโนโลยี', ' วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'ว.6215', '6240258108', 'นางสาววรรณวลี โททอง', '1389', '', '1', '2022-05-29 15:16:57'),
(157, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6209', '6240247102', 'นายเกษมสันต์ บุดดา', '1390', '', '1', '2022-05-29 15:16:57'),
(158, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6209', '6240247103', 'นางสาวณัฐกมล คำแหง', '1391', '', '1', '2022-05-29 15:16:57'),
(159, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6209', '6240247105', 'นางสาวน้ำผึ้ง หอมคุณ', '1392', '', '1', '2022-05-29 15:16:57'),
(160, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6209', '6240247106', 'นางสาวเบญจมาศ บุญไชยโย', '1393', '', '1', '2022-05-29 15:16:57'),
(161, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6209', '6240247110', 'นางสาวมนทิรา แสนเห็มทอง', '1394', '', '1', '2022-05-29 15:16:57'),
(162, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6209', '6240247112', 'นายศรัณย์ ซาปาน', '1395', '', '1', '2022-05-29 15:16:57'),
(163, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6209', '6240247113', 'นางสาวสุดาวรรณ เกตกรม', '1396', '', '1', '2022-05-29 15:16:57'),
(164, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6209', '6240247114', 'นางสาวสุภารัตน์ บุญคล่ำ', '1397', '', '1', '2022-05-29 15:16:57'),
(165, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6209', '6240247115', 'นายอดิศร จันดี', '1398', '', '1', '2022-05-29 15:16:57'),
(166, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6209', '6240247116', 'นางสาวอภิญญา ลีทา', '1399', '', '1', '2022-05-29 15:16:57'),
(167, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6209', '6240247117', 'นางสาวอารีญา บุษบา', '1400', '', '1', '2022-05-29 15:16:57'),
(168, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6209', '6240247118', 'นางสาวจิราวรรณ จันทรัตน์', '1401', '', '1', '2022-05-29 15:16:57'),
(169, 'วิทยาศาสตร์และเทคโนโลยี', 'สัตวศาสตร์', 'ว.6210', '6240266102', 'นางสาวชฎาพร พันน้อย', '1402', '', '1', '2022-05-29 15:16:57'),
(170, 'วิทยาศาสตร์และเทคโนโลยี', 'สัตวศาสตร์', 'ว.6210', '6240266104', 'นางสาวบุษบา นามวงษ์', '1403', '', '1', '2022-05-29 15:16:57'),
(171, 'วิทยาศาสตร์และเทคโนโลยี', 'สัตวศาสตร์', 'ว.6210', '6240266105', 'นายพงศ์เพชร พิทักษ์พงษ์', '1404', '', '1', '2022-05-29 15:16:57'),
(172, 'วิทยาศาสตร์และเทคโนโลยี', 'สัตวศาสตร์', 'ว.6210', '6240266107', 'นางสาวรักษิกา สอนสุภาพ', '1405', '', '1', '2022-05-29 15:16:57'),
(173, 'วิทยาศาสตร์และเทคโนโลยี', 'สัตวศาสตร์', 'ว.6210', '6240266108', 'นางสาววรีรัตน์ ฤทธิศักดิ์', '1406', '', '1', '2022-05-29 15:16:57'),
(174, 'วิทยาศาสตร์และเทคโนโลยี', 'สัตวศาสตร์', 'ว.6210', '6240266109', 'นางสาววีรยา เวียงสมุทร', '1407', '', '1', '2022-05-29 15:16:57'),
(175, 'วิทยาศาสตร์และเทคโนโลยี', 'สัตวศาสตร์', 'ว.6210', '6240266110', 'นางสาวสิริยากร พลลาภ', '1408', '', '1', '2022-05-29 15:16:57'),
(176, 'วิทยาศาสตร์และเทคโนโลยี', 'สัตวศาสตร์', 'ว.6210', '6240266111', 'นางสาวสุดารัตน์ วงษ์ชมภู', '1409', '', '1', '2022-05-29 15:16:57'),
(177, 'วิทยาศาสตร์และเทคโนโลยี', 'สัตวศาสตร์', 'ว.6210', '6240266112', 'นางสาวสุภัทธา จันเทพา', '1410', '', '1', '2022-05-29 15:16:57'),
(178, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270103', 'นางสาวกุลธิดา ศรีชามก', '1411', '', '1', '2022-05-29 15:16:57'),
(179, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270105', 'นางสาวเขมิสุดา หมู่หัวนา', '1412', '', '1', '2022-05-29 15:16:57'),
(180, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270106', 'นายคามิน เทพประเสริฐ', '1413', '', '1', '2022-05-29 15:16:57'),
(181, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270107', 'นายจักรกฤษ บุญประสพ', '1414', '', '1', '2022-05-29 15:16:57'),
(182, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270109', 'นางสาวชนัญญา วิจิตรปัญญา', '1415', '', '1', '2022-05-29 15:16:57'),
(183, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270111', 'นางสาวชิดชนก ธนาทิพยกุล', '1416', '', '1', '2022-05-29 15:16:57'),
(184, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270112', 'นางสาวฐิติญา แสนพรมมา', '1417', '', '1', '2022-05-29 15:16:57'),
(185, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270114', 'นายธณาวุฒิ บุญประคม', '1418', '', '1', '2022-05-29 15:16:57'),
(186, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270115', 'นางสาวธัญพิชชา ใจชื่น', '1419', '', '1', '2022-05-29 15:16:57'),
(187, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270116', 'นางสาวธัฐชา นำธรรมมา', '1420', '', '1', '2022-05-29 15:16:57'),
(188, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270117', 'นางสาวนิษฐา แก้วสา', '1421', '', '1', '2022-05-29 15:16:57'),
(189, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270118', 'นางสาวปิยพร ภาโนมัย', '1422', '', '1', '2022-05-29 15:16:57'),
(190, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270119', 'นางสาวพรชนภ สุมามาน', '1423', '', '1', '2022-05-29 15:16:57'),
(191, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270122', 'นางสาวมณีฑิตา บุญศรี', '1424', '', '1', '2022-05-29 15:16:57'),
(192, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270123', 'นางสาวมลิวัลย์ โคตรศรีวงษ์', '1425', '', '1', '2022-05-29 15:16:57'),
(193, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270124', 'นายเมธา จันทะวงษ์', '1426', '', '1', '2022-05-29 15:16:57'),
(194, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270125', 'นางสาวลัลลิยา รัตนหุน', '1427', '', '1', '2022-05-29 15:16:57'),
(195, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270126', 'นายวงศกร แพงสุ่ย', '1428', '', '1', '2022-05-29 15:16:57'),
(196, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270128', 'นายวรโชติ มณีจักร', '1429', '', '1', '2022-05-29 15:16:57'),
(197, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270129', 'นางสาววันวิสา ชัยขุน', '1430', '', '1', '2022-05-29 15:16:57'),
(198, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270130', 'นางสาววาสิกา สิมสวัสดิ์', '1431', '', '1', '2022-05-29 15:16:57'),
(199, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270132', 'นางสาววิไลพร จันสีดา', '1432', '', '1', '2022-05-29 15:16:57'),
(200, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270133', 'นายวิวัฒน์ บุญตอม', '1433', '', '1', '2022-05-29 15:16:57'),
(201, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270134', 'นายวุฒิชัย จำปานิล', '1434', '', '1', '2022-05-29 15:16:57'),
(202, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270135', 'นายวุฒิพงษ์ พรมอินทร์', '1435', '', '1', '2022-05-29 15:16:57'),
(203, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270137', 'นายสุทัศน์ เทพวงค์ษา', '1436', '', '1', '2022-05-29 15:16:57'),
(204, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270138', 'นางสาวสุภาวิตา มาดี', '1437', '', '1', '2022-05-29 15:16:57'),
(205, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270139', 'นางสาวอนุชจิตรา เงินมูล', '1438', '', '1', '2022-05-29 15:16:57'),
(206, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270140', 'นางสาวอภินันท์ ผันผ่อน', '1439', '', '1', '2022-05-29 15:16:57'),
(207, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270143', 'นายทินกร สอนสุภาพ', '1440', '', '1', '2022-05-29 15:16:57'),
(208, 'วิทยาศาสตร์และเทคโนโลยี', 'คณิตศาสตร์', 'ว.6203', '6240270144', 'นางสาวกัลยกร น้อยวัน', '1441', '', '1', '2022-05-29 15:16:57'),
(209, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283106', 'นางสาวชลิตา ขุนพิรินทร์', '1442', '', '1', '2022-05-29 15:16:57'),
(210, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283107', 'นายโชคทวี คำป๊อก', '1443', '', '1', '2022-05-29 15:16:57'),
(211, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283108', 'นางสาวณัฐกานต์ หมื่นเจริญ', '1444', '', '1', '2022-05-29 15:16:57'),
(212, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283110', 'นายดิเรกรัตน์ เจดีย์', '1445', '', '1', '2022-05-29 15:16:57'),
(213, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283112', 'นายธนพล คำมงคุณ', '1446', '', '1', '2022-05-29 15:16:57'),
(214, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283113', 'นายธนายุทธ จันทพิมพ์', '1447', '', '1', '2022-05-29 15:16:57'),
(215, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283114', 'นายธราเทพ ผุยทา', '1448', '', '1', '2022-05-29 15:16:57'),
(216, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283116', 'นายนันทวัฒน์ กลัดนุถะ', '1449', '', '1', '2022-05-29 15:16:57'),
(217, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283118', 'นางสาวปานไพลิน สุจิมงคล', '1450', '', '1', '2022-05-29 15:16:57'),
(218, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283120', 'นายพลากร ไชยแสง', '1451', '', '1', '2022-05-29 15:16:57'),
(219, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283121', 'นายพีระพงษ์ วงษ์สะอาด', '1452', '', '1', '2022-05-29 15:16:57'),
(220, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283122', 'นางสาวแพรไหม เพ็งสุข', '1453', '', '1', '2022-05-29 15:16:57'),
(221, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283123', 'นางสาวภาคินี งาสีแดง', '1454', '', '1', '2022-05-29 15:16:57'),
(222, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283125', 'นางสาวมัทนา สุริวงค์', '1455', '', '1', '2022-05-29 15:16:57'),
(223, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283128', 'นายวีรภัทร สุธรรมาภิวัฒน์', '1456', '', '1', '2022-05-29 15:16:57'),
(224, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283131', 'นายศุภศิลป์ วรรณศรี', '1457', '', '1', '2022-05-29 15:16:57'),
(225, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283133', 'นายสิรจรัส ป้องศิริ', '1458', '', '1', '2022-05-29 15:16:57'),
(226, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283135', 'นางสาวโสภิดา เก่งชัยภูมิ', '1459', '', '1', '2022-05-29 15:16:57'),
(227, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283137', 'นายอภิวิชญ์ ลุนาหา', '1460', '', '1', '2022-05-29 15:16:57'),
(228, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283138', 'นางสาวอรอนงค์ ครุธวงษ์', '1461', '', '1', '2022-05-29 15:16:57'),
(229, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283139', 'นายอัสรินทร์ รู้บุญ', '1462', '', '1', '2022-05-29 15:16:57'),
(230, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6211', '6240283141', 'นายพัฒนมงคล เหมือนศรีไชย', '1463', '', '1', '2022-05-29 15:16:57'),
(231, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283201', 'นายกฤษณะ ยืดยาว', '1464', '', '1', '2022-05-29 15:16:57'),
(232, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283202', 'นายเกียรติศักดิ์ ทองอัญชา', '1465', '', '1', '2022-05-29 15:16:57'),
(233, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283205', 'นายเจตริน แสงจันทร์', '1466', '', '1', '2022-05-29 15:16:57'),
(234, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283209', 'นายณัฐวุฒิ บุญขันธ์', '1467', '', '1', '2022-05-29 15:16:57'),
(235, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283210', 'นายทินวุธ ครูลอง', '1468', '', '1', '2022-05-29 15:16:57'),
(236, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283211', 'นายธนบัตร กาญจนะโกมล', '1469', '', '1', '2022-05-29 15:16:57'),
(237, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283212', 'นายธนพล นพรัตน์', '1470', '', '1', '2022-05-29 15:16:57'),
(238, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283213', 'นายธรรณพ์พล หินจันทร์', '1471', '', '1', '2022-05-29 15:16:57'),
(239, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283214', 'นายธวัชชัย สมภารสิงห์', '1472', '', '1', '2022-05-29 15:16:57'),
(240, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283215', 'นางสาวนัทดา ฟ้องเสียง', '1473', '', '1', '2022-05-29 15:16:57'),
(241, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283217', 'นายปรัญกร เอมศิริ', '1474', '', '1', '2022-05-29 15:16:57'),
(242, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283219', 'นางสาวพรชิตา พรหมเมตตา', '1475', '', '1', '2022-05-29 15:16:57'),
(243, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283220', 'นายพัฒนพงศ์ ทำทิพย์', '1476', '', '1', '2022-05-29 15:16:57'),
(244, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283221', 'นายพุทธกาล บัวบาลบุตร', '1477', '', '1', '2022-05-29 15:16:57'),
(245, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283222', 'นายภราดร ยุพิน', '1478', '', '1', '2022-05-29 15:16:57'),
(246, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283223', 'นายภาณุพงศ์ มาดา', '1479', '', '1', '2022-05-29 15:16:57'),
(247, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283224', 'นายมังคเลศ ศรีโม', '1480', '', '1', '2022-05-29 15:16:57'),
(248, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283225', 'นางสาวเมสิยา ภู่ขาว', '1481', '', '1', '2022-05-29 15:16:57'),
(249, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283226', 'นายเริงสันต์ ดวงไชย', '1482', '', '1', '2022-05-29 15:16:57'),
(250, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283227', 'นางสาววันวิสา กาญจนะกัญโห', '1483', '', '1', '2022-05-29 15:16:57'),
(251, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283228', 'นายวุฒิชัย พิลาฤทธิ์', '1484', '', '1', '2022-05-29 15:16:57'),
(252, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283230', 'นายศุภโชค อาจแก้ว', '1485', '', '1', '2022-05-29 15:16:57'),
(253, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283232', 'นายสหัสวรรษ โสประดิษฐ์', '1486', '', '1', '2022-05-29 15:16:57'),
(254, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283234', 'นายสุรศักดิ์ วงษ์คำจันทร์', '1487', '', '1', '2022-05-29 15:16:57'),
(255, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283235', 'นางสาวอธิชา เจริญคุณ', '1488', '', '1', '2022-05-29 15:16:57'),
(256, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283236', 'นายอธิวัฒน์ พรมมาวัน', '1489', '', '1', '2022-05-29 15:16:57'),
(257, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283237', 'นายอภิศักดิ์ เพ็ชรยิ้ม', '1490', '', '1', '2022-05-29 15:16:57'),
(258, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283238', 'นายอลังการ ปิ่นคำ', '1491', '', '1', '2022-05-29 15:16:57'),
(259, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283239', 'นายอานุภาพ ไชยวงศ์', '1492', '', '1', '2022-05-29 15:16:57'),
(260, 'วิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์การกีฬาและการออกกำลังกาย', 'ว.6212', '6240283240', 'นายอภิสิทธิ์ พรมขรยาง', '1493', '', '1', '2022-05-29 15:16:57'),
(262, 'คณะวิทยาศาสตร์และเทคโนโลยี', 'เทคโนโลยีสารสนเทศ', 'sss', 'sss', 'นาย', '9f6e6800cfae7749eb6c486619254b9c', '', '1', '2023-09-13 07:23:08'),
(263, 'คณะวิทยาศาสตร์และเทคโนโลยี', 'ชีววิทยา', 'aaa', 'aaa', 'นางสาวaaa', '47bce5c74f589f4867dbd57e9ca9f808', '', '1', '2023-09-13 07:25:01'),
(266, 'คณะวิทยาศาสตร์และเทคโนโลยี', 'วิทยาศาสตร์สิ่งแวดล้อม', 'ว.6601', '6612312224', 'นายสังสรรค์ หล้าพันธ์', '58c520c064cd87ed2b3357c8b54fd12c', '', '1', '2023-09-13 07:34:48'),
(267, 'คณะวิทยาศาสตร์และเทคโนโลยี', 'วิทยาการคอมพิวเตอร์', 'ว.6502', '6521212123', 'ว่าที่ร้อยตรีนรชัย สอนใส', '18bd052f7be54f70f08cf19fc9bc0902', '', '1', '2023-09-13 07:41:10'),
(269, 'คณะวิทยาศาสตร์และเทคโนโลยี', 'เกษตรศาสตร์', '3', '3', 'นางสาวด ก', 'eccbc87e4b5ce2fe28308fd9f2a7baf3', '', '1', '2023-09-13 07:48:25');

-- --------------------------------------------------------

--
-- Table structure for table `tblusers`
--

CREATE TABLE `tblusers` (
  `id` int(11) NOT NULL,
  `fullname` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `username` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `useremail` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `faculty` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `position` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `img` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `faculty_id` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `pass_update` varchar(1) COLLATE utf8_unicode_ci NOT NULL,
  `status` enum('pending','approved','rejected') COLLATE utf8_unicode_ci NOT NULL DEFAULT 'pending'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `tblusers`
--

INSERT INTO `tblusers` (`id`, `fullname`, `username`, `useremail`, `faculty`, `position`, `password`, `img`, `faculty_id`, `pass_update`, `status`) VALUES
(1, 'นายสังสรรค์ หล้าพันธ์', 'admin', 'sunksun.lap@lru.ac.th', 'คณะวิทยาศาสตร์และเทคโนโลยี', 'ผู้ดูแลระบบ', '594fb2c51dc352c5860143b7c4980306', 'avatar.png', '1', '1', 'approved'),
(7, 'นางสาวจิตร์ วังคีรี', 'admin', 'admin@lru.ac.th', 'สำนักส่งเสริมวิชาการและงานทะเบียน', 'ผู้ดูแลระบบ', 'ea444c152139a12a248ee598241be30d', 'avatar4.png', '1', '1', 'approved'),
(13, 'ว่าที่ร้อยเอกนรชัย สอนใส', 'admin', 'admin@lru.ac.th', 'สำนักส่งเสริมวิชาการและงานทะเบียน', 'ผู้ดูแลระบบ', 'c93ccd78b2076528346216b3b2f701e6', 'avatar4.png', '1', '1', 'approved'),
(29, 'ประเสริฐ ลูกแก้ว', 'admin_sci', 'etc.sci.lru@gmail.com', 'คณะวิทยาศาสตร์และเทคโนโลยี', 'นักวิชาการศึกษาปฏิบัติการ', '25f9e794323b453885f5181f1b624d0b', 'avatar.png', '02', '1', 'approved'),
(30, 'ศกุลตรา นามวงษ์', 'admin_hum', 'Sakultra.won@lru.ac.th', 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'นักวิชาการศึกษา', 'fbb3a42251d37757b62bf4cb31cbf64e', 'avatar.png', '04', '1', 'approved'),
(31, 'ทัศนีย์ บุตรเพ็ง', 'admin_tec', 'tasanee.bud@lru.ac.th', 'คณะเทคโนโลยีอุตสาหกรรม', 'เจ้าหน้าที่บริหารงานทั่วไป', '11c4863cc25e39822f8d0068057c9cdd', 'avatar.png', '03', '1', 'approved'),
(32, 'นางสาวเกศฤทัย  ศรีสุทร', 'admin_fms', 'kesruathai2527@gmail.com', 'คณะวิทยาการจัดการ', 'ผู้ปฏิบัติงานบริหาร', 'c178fc8a3a1e6452c51c4e23681c4c3c', 'avatar.png', '01', '1', 'approved'),
(33, 'ศกุลตรา นามวงษ์', 'admin_hum', 'Sakultra.won@lru.ac.th', 'คณะมนุษยศาสตร์และสังคมศาสตร์', 'นักวิชาการศึกษา', '11c4863cc25e39822f8d0068057c9cdd', 'avatar.png', '04', '1', 'approved'),
(34, 'นางสาวเกศฤทัย  ศรีสุทร', 'admin_fms', 'kesruathai2527@gmail.com', 'คณะวิทยาการจัดการ', 'ผู้ปฏิบัติงานบริหาร', '11c4863cc25e39822f8d0068057c9cdd', 'avatar.png', '01', '1', 'approved');

-- --------------------------------------------------------

--
-- Table structure for table `tea_cwie`
--

CREATE TABLE `tea_cwie` (
  `id` int(11) NOT NULL,
  `faculty` varchar(250) NOT NULL,
  `course` varchar(250) NOT NULL,
  `name_tea_cwie` varchar(200) NOT NULL,
  `num_tea_cwie` varchar(20) NOT NULL,
  `filename` varchar(250) NOT NULL,
  `date_regis` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `thai_provinces`
--

CREATE TABLE `thai_provinces` (
  `id` int(11) NOT NULL,
  `thai_province` varchar(100) NOT NULL,
  `eng_provinces` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `thai_provinces`
--

INSERT INTO `thai_provinces` (`id`, `thai_province`, `eng_provinces`) VALUES
(1, 'กรุงเทพมหานคร', 'Bangkok\r'),
(2, 'สมุทรปราการ', 'Samut Prakan\r'),
(3, 'นนทบุรี', 'Nonthaburi\r'),
(4, 'ปทุมธานี', 'Pathum Thani\r'),
(5, 'พระนครศรีอยุธยา', 'Phra Nakhon Si Ayutthaya\r'),
(6, 'อ่างทอง', 'Ang Thong\r'),
(7, 'ลพบุรี', 'Loburi\r'),
(8, 'สิงห์บุรี', 'Sing Buri\r'),
(9, 'ชัยนาท', 'Chai Nat\r'),
(10, 'สระบุรี', 'Saraburi\r'),
(11, 'ชลบุรี', 'Chon Buri\r'),
(12, 'ระยอง', 'Rayong\r'),
(13, 'จันทบุรี', 'Chanthaburi\r'),
(14, 'ตราด', 'Trat\r'),
(15, 'ฉะเชิงเทรา', 'Chachoengsao\r'),
(16, 'ปราจีนบุรี', 'Prachin Buri\r'),
(17, 'นครนายก', 'Nakhon Nayok\r'),
(18, 'สระแก้ว', 'Sa Kaeo\r'),
(19, 'นครราชสีมา', 'Nakhon Ratchasima\r'),
(20, 'บุรีรัมย์', 'Buri Ram\r'),
(21, 'สุรินทร์', 'Surin\r'),
(22, 'ศรีสะเกษ', 'Si Sa Ket\r'),
(23, 'อุบลราชธานี', 'Ubon Ratchathani\r'),
(24, 'ยโสธร', 'Yasothon\r'),
(25, 'ชัยภูมิ', 'Chaiyaphum\r'),
(26, 'อำนาจเจริญ', 'Amnat Charoen\r'),
(27, 'หนองบัวลำภู', 'Nong Bua Lam Phu\r'),
(28, 'ขอนแก่น', 'Khon Kaen\r'),
(29, 'อุดรธานี', 'Udon Thani\r'),
(30, 'เลย', 'Loei\r'),
(31, 'หนองคาย', 'Nong Khai\r'),
(32, 'มหาสารคาม', 'Maha Sarakham\r'),
(33, 'ร้อยเอ็ด', 'Roi Et\r'),
(34, 'กาฬสินธุ์', 'Kalasin\r'),
(35, 'สกลนคร', 'Sakon Nakhon\r'),
(36, 'นครพนม', 'Nakhon Phanom\r'),
(37, 'มุกดาหาร', 'Mukdahan\r'),
(38, 'เชียงใหม่', 'Chiang Mai\r'),
(39, 'ลำพูน', 'Lamphun\r'),
(40, 'ลำปาง', 'Lampang\r'),
(41, 'อุตรดิตถ์', 'Uttaradit\r'),
(42, 'แพร่', 'Phrae\r'),
(43, 'น่าน', 'Nan\r'),
(44, 'พะเยา', 'Phayao\r'),
(45, 'เชียงราย', 'Chiang Rai\r'),
(46, 'แม่ฮ่องสอน', 'Mae Hong Son\r'),
(47, 'นครสวรรค์', 'Nakhon Sawan\r'),
(48, 'อุทัยธานี', 'Uthai Thani\r'),
(49, 'กำแพงเพชร', 'Kamphaeng Phet\r'),
(50, 'ตาก', 'Tak\r'),
(51, 'สุโขทัย', 'Sukhothai\r'),
(52, 'พิษณุโลก', 'Phitsanulok\r'),
(53, 'พิจิตร', 'Phichit\r'),
(54, 'เพชรบูรณ์', 'Phetchabun\r'),
(55, 'ราชบุรี', 'Ratchaburi\r'),
(56, 'กาญจนบุรี', 'Kanchanaburi\r'),
(57, 'สุพรรณบุรี', 'Suphan Buri\r'),
(58, 'นครปฐม', 'Nakhon Pathom\r'),
(59, 'สมุทรสาคร', 'Samut Sakhon\r'),
(60, 'สมุทรสงคราม', 'Samut Songkhram\r'),
(61, 'เพชรบุรี', 'Phetchaburi\r'),
(62, 'ประจวบคีรีขันธ์', 'Prachuap Khiri Khan\r'),
(63, 'นครศรีธรรมราช', 'Nakhon Si Thammarat\r'),
(64, 'กระบี่', 'Krabi\r'),
(65, 'พังงา', 'Phangnga\r'),
(66, 'ภูเก็ต', 'Phuket\r'),
(67, 'สุราษฎร์ธานี', 'Surat Thani\r'),
(68, 'ระนอง', 'Ranong\r'),
(69, 'ชุมพร', 'Chumphon\r'),
(70, 'สงขลา', 'Songkhla\r'),
(71, 'สตูล', 'Satun\r'),
(72, 'ตรัง', 'Trang\r'),
(73, 'พัทลุง', 'Phatthalung\r'),
(74, 'ปัตตานี', 'Pattani\r'),
(75, 'ยะลา', 'Yala\r'),
(76, 'นราธิวาส', 'Narathiwat\r'),
(77, 'บึงกาฬ', 'buogkan');

-- --------------------------------------------------------

--
-- Table structure for table `year`
--

CREATE TABLE `year` (
  `id` int(10) NOT NULL,
  `year` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `year`
--

INSERT INTO `year` (`id`, `year`) VALUES
(1, '1/2567'),
(2, '2/2567');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `activity`
--
ALTER TABLE `activity`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `activity_cwie`
--
ALTER TABLE `activity_cwie`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `activity_photo`
--
ALTER TABLE `activity_photo`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `activity_type`
--
ALTER TABLE `activity_type`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `approval_tokens`
--
ALTER TABLE `approval_tokens`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Indexes for table `course`
--
ALTER TABLE `course`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cwie_course`
--
ALTER TABLE `cwie_course`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `day`
--
ALTER TABLE `day`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `faculty`
--
ALTER TABLE `faculty`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `job_cwie`
--
ALTER TABLE `job_cwie`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `major`
--
ALTER TABLE `major`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `mount`
--
ALTER TABLE `mount`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `num_stu_cwie`
--
ALTER TABLE `num_stu_cwie`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `num_tea_cwie`
--
ALTER TABLE `num_tea_cwie`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `organization`
--
ALTER TABLE `organization`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `organization_mou`
--
ALTER TABLE `organization_mou`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `semester`
--
ALTER TABLE `semester`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `stu_highlight`
--
ALTER TABLE `stu_highlight`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tblstudent`
--
ALTER TABLE `tblstudent`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tblusers`
--
ALTER TABLE `tblusers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tea_cwie`
--
ALTER TABLE `tea_cwie`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `thai_provinces`
--
ALTER TABLE `thai_provinces`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `year`
--
ALTER TABLE `year`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `activity`
--
ALTER TABLE `activity`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `activity_cwie`
--
ALTER TABLE `activity_cwie`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `activity_photo`
--
ALTER TABLE `activity_photo`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `activity_type`
--
ALTER TABLE `activity_type`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `approval_tokens`
--
ALTER TABLE `approval_tokens`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `course`
--
ALTER TABLE `course`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `cwie_course`
--
ALTER TABLE `cwie_course`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `faculty`
--
ALTER TABLE `faculty`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `job_cwie`
--
ALTER TABLE `job_cwie`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `major`
--
ALTER TABLE `major`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=65;

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `num_stu_cwie`
--
ALTER TABLE `num_stu_cwie`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `num_tea_cwie`
--
ALTER TABLE `num_tea_cwie`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT for table `organization`
--
ALTER TABLE `organization`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `organization_mou`
--
ALTER TABLE `organization_mou`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT for table `semester`
--
ALTER TABLE `semester`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `stu_highlight`
--
ALTER TABLE `stu_highlight`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `tblstudent`
--
ALTER TABLE `tblstudent`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=270;

--
-- AUTO_INCREMENT for table `tblusers`
--
ALTER TABLE `tblusers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- AUTO_INCREMENT for table `tea_cwie`
--
ALTER TABLE `tea_cwie`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `year`
--
ALTER TABLE `year`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `approval_tokens`
--
ALTER TABLE `approval_tokens`
  ADD CONSTRAINT `approval_tokens_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `tblusers` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
